{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(tret que el distribu茂dor del vostre binari MariaDB estigui retroportant peda莽os de seguretat)",
        "BackportingDisclaimerPHP": "(tret que el distribu茂dor del vostre binari PHP estigui retroportant peda莽os de seguretat)",
        "CurlVersionCheckFailed": "Matomo no ha pogut comprovar si la vostra versi贸 curl t茅 vulnerabilitats.",
        "CurlVersionCheckLabel": "comprovaci贸 de la versi贸 de curl",
        "CurlVersionCheckNoCurl": "La vostra configuraci贸 de PHP no utilitza curl, de manera que no hi ha res a comprovar.",
        "CurlVersionCheckUpToDate": "Sembla que no hi ha vulnerabilitats conegudes a la vostra versi贸 curl (%s).",
        "CurlVersionCheckVulnerable": "La vostra versi贸 de curl (%s) pot ser vulnerable a aquestes vulnerabilitats (tret que el distribu茂dor del vostre binari de curl tingui peda莽os de seguretat posteriors):",
        "DatabaseVersionCheckLabel": "Versi贸 de la base de dades",
        "DatabaseVersionCheckMariaDBEol": "La vostra versi贸 de MariaDB (%1$s) ja no rep suport de seguretat per part de l'equip de MariaDB (des de %2$s). Haur铆eu d'actualitzar a una versi贸 m茅s nova",
        "DatabaseVersionCheckMariaDBLatestVersion": "Esteu utilitzant la darrera versi贸 de MariaDB %s.",
        "DatabaseVersionCheckMariaDBNotEol": "La vostra versi贸 de MariaDB (%1$s) rep suport de seguretat per part de l'equip de MariaDB fins a %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "Hi ha una versi贸 m茅s recent del peda莽 de MariaDB (%1$s) disponible (esteu utilitzant %2$s/%3$s). Haur铆eu d'actualitzar tan aviat com sigui possible",
        "MatomoJSCheckFailed": "Sembla que matomo.js no es pot recuperar correctament.",
        "MatomoJSCheckFailedCurlTip": "proveu d'executar %s al vostre servidor i comproveu si 茅s capa莽 d'obtenir el fitxer correctament",
        "MatomoJSCheckGzipped": "matomo.js es lliura comprimit.",
        "MatomoJSCheckMIMEError": "matomo.js s'ha de lliurar amb un tipus de contingut \"aplicaci贸/javascript\". Esteu utilitzant '%s'.",
        "MatomoJSCheckNotGzipped": "matomo.js no es lliura com a gzip. s possible que vulgueu configurar gzip per a fitxers .js, ja que pot reduir la mida del fitxer fins a un 60%.",
        "MatomoJSCheckUnknown": "Matomo no ha pogut comprovar si el vostre matomo.js es pot obtenir correctament.",
        "NotificationText": "Heu habilitat el connector DiagnosticsExtended, que afegeix unes quantes comprovacions experimentals del sistema m茅s (marcades amb И) a aquesta pgina que us poden ajudar a trobar problemes amb la vostra instncia de Matomo. Encara pot haver-hi alguns falsos positius i falsos negatius, aix铆 que no prengueu els resultats com a certs, per貌 comproveu si alguna cosa no funciona. Informeu dels problemes amb el connector al %1$sforum%2$s o %3$sobriu un problema de GitHub%4$s perqu猫 les comprovacions es puguin millorar.",
        "NotificationTitle": "Sobre DiagnosticsExtended",
        "OpcacheCheckInternedStrings": "Sembla que heu establert <code>opcache.interned_strings_buffer</code> per sota de 8MB, que pot ser una mica baix. Si us plau augmenteu el valor a 8 (Megabyte) o m茅s depenent de quants fitxers PHP utilitzeu i de quanta mem貌ria tingui disponible el vostre servidor.",
        "OpcacheCheckJIT": "Com que utilitzeu PHP 8 o m茅s recent, potser voldreu mirar com habilitar el compilador JIT. Potser podria accelerar una mica Matomo. Tamb茅 seria fantstic si pogu茅ssiu informar de qualsevol experi猫ncia despr茅s d'habilitar PHP JIT.",
        "OpcacheCheckMaxFiles": "Sembla que heu configurat <code>opcache.max_accelerated_files</code> a %s o per sota, cosa que pot ser massa baixa per mantenir tots els fitxers Matomo a la mem貌ria cau, especialment si tamb茅 esteu allotjant altres aplicacions PHP. Definiu l'opci贸 a 7963, 16229 o 32531 en funci贸 del nombre de fitxers PHP que utilitzi el vostre servidor web.",
        "OpcacheCheckMemory": "Sembla que heu establert <code>opcache.memory_consumption</code> per sota de 128 MB, cosa que pot ser massa baix per mantenir tots els fitxers Matomo a la mem貌ria cau, especialment si tamb茅 allotgeu altres aplicacions PHP. Si us plau, augmenteu el valor a 128 o 256 (Megabyte) en funci贸 de quants fitxers PHP utilitzeu i de la quantitat de mem貌ria disponible del vostre servidor.",
        "OpcacheCheckOpcacheDisabled": "Sembla que OPcache est desactivat a la configuraci贸 de PHP. OPcache emmagatzema bytecode dels scripts PHP a la mem貌ria i, per tant, pot accelerar for莽a PHP ja que evita carregar i analitzar fitxers PHP a cada sol路licitud. Comproveu la configuraci贸 <code>opcache.enable</code> php.ini per obtenir m茅s informaci贸.",
        "OpcacheCheckOpcacheEnabled": "Sembla que OPcache est habilitat. %1$sMB de %2$sMB s'utilitzen per als scripts PHP (%3$s%% malgastats) i %4$sMB de %5$sMB s'utilitzen per a les cadenes internades.%6$s%% de sol路licituds arriben a OPcache.",
        "OpcacheCheckSaveComments": "Sembla que heu desactivat la configuraci贸 <code>opcache.save_comments</code>. Aix貌 elimina els comentaris de l'OPcache fent-lo m茅s petit, per貌 trenca Matomo. Definiu <code>opcache.save_comments</code> a <code>0</code>",
        "OpcacheCheckValidateTimestamps": "Sembla que heu desactivat <code>opcache.validate_timestamps</code>, la qual cosa significa que PHP mai comprovar si els fitxers reals del disc han canviat, sin贸 que continuar utilitzant els de la mem貌ria cau. En teoria, aix貌 no hauria de ser cap problema, ja que Matomo invalida l'OPcache a les actualitzacions i instal路lacions, per貌 potser voldreu mirar-ho si us trobeu amb problemes estranys.",
        "OpensslVersionCheckLabel": "Comprovaci贸 de la versi贸 d'OpenSSL",
        "OpensslVersionCheckNoOpenssl": "La vostra configuraci贸 de PHP no utilitza OpenSSL ni curl, de manera que no hi ha res a comprovar.",
        "OpensslVersionCheckNotOutdated": "La vostra versi贸 d'OpenSSL (%s) no 茅s realment antiga. No obstant aix貌, comproveu si hi ha vulnerabilitats conegudes i actualitzeu-la si cal.",
        "OpensslVersionCheckOutdated": "La vostra versi贸 d'OpenSSL (%s) 茅s for莽a antiga. Comproveu si hi ha vulnerabilitats conegudes i actualitzeu-la si cal.",
        "PhpIniCheckIsDisabled": "%s est activat",
        "PhpIniCheckIsEnabled": "%s est activat",
        "PhpIniCheckLabel": "opcions php.ini",
        "PhpIniCheckShouldBeDisabled": "%s hauria d'estar desctivat",
        "PhpIniCheckShouldBeEnabled": "%s hauria d'estar activat",
        "PhpUserCheckLabel": "PHP s'executa com a root",
        "PhpUserCheckWarning": "Sembla que PHP s'est executant com a root. A menys que utilitzeu Matomo dins d'un contenidor docker, haur铆eu de comprovar la vostra configuraci贸.",
        "PhpVersionCheckEol": "La vostra versi贸 de PHP (%1$s) ja no rep suport de seguretat per part de l'equip de PHP (des de %2$s). Haur铆eu d'actualitzar a una versi贸 m茅s nova",
        "PhpVersionCheckLabel": "versi贸 PHP",
        "PhpVersionCheckLatestVersion": "Esteu utilitzant la darrera versi贸 de PHP %s",
        "PhpVersionCheckNoInformation": "No es coneix cap informaci贸 sobre la vostra versi贸 de PHP (%s)",
        "PhpVersionCheckNotEol": "La vostra versi贸 de PHP (%1$s) rep suport de seguretat per part de l'equip de PHP fins a %2$s.",
        "PhpVersionCheckNotWorking": "Matomo no ha pogut comprovar si la vostra versi贸 de PHP est actualitzada",
        "PhpVersionCheckOutdated": "Hi ha una versi贸 m茅s nova del peda莽 de PHP (%1$s) disponible (esteu utilitzant %2$s). Haur铆eu d'actualitzar tan aviat com sigui possible"
    }
}
