{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(es sei denn, der Distributor Ihrer MariaDB-Binärdatei portiert Sicherheitspatches zurück)",
        "BackportingDisclaimerPHP": "(es sei denn, der Distributor Ihrer PHP-Binärdatei portiert Sicherheitspatches zurück)",
        "CurlVersionCheckFailed": "Matomo konnte nicht überprüfen, ob Ihre curl-Version Sicherheitslücken aufweist.",
        "CurlVersionCheckLabel": "curl Versionsprüfung",
        "CurlVersionCheckNoCurl": "Ihr PHP-Setup verwendet curl nicht, es gibt also nichts zu überprüfen.",
        "CurlVersionCheckUpToDate": "Es scheint keine bekannten Schwachstellen in Ihrer curl Version zu geben (%s).",
        "CurlVersionCheckVulnerable": "Ihre curl Version (%s) ist möglicherweise über diese Schwachsellen verwundbar (es sei denn, der Distributor Ihrer curl Binaries unterstützt zurückportierte Security Patches):",
        "DatabaseVersionCheckLabel": "Datenbank Version",
        "DatabaseVersionCheckMariaDBEol": "Ihre MariaDB Version (%1$s) erhält keinen Sicherheitssupport mehr durch das MariaDB Team (seit %2$s). Sie sollten auf eine neuere Version aktualisieren",
        "DatabaseVersionCheckMariaDBLatestVersion": "Sie verwenden die aktuelle Version von MariaDB %s.",
        "DatabaseVersionCheckMariaDBNotEol": "Ihre MariaDB Version (%1$s) erhält Sicherheitssupport durch das MariaDB Team bis %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "Es ist eine neuere MariaDB Patch Version (%1$s) verfügbar (Sie verwenden %2$s/%3$s). Sie sollten so schnell wie möglich auf die neue Version aktualisieren",
        "MatomoJSCheckFailed": "So wie es aussieht, kann matomo.js nicht korrekt abgerufen werden.",
        "MatomoJSCheckFailedCurlTip": "versuchen Sie, %s auf Ihrem Server laufen zu lassen und prüfen Sie ob es möglich ist, die Datei erfolgreich abzurufen",
        "MatomoJSCheckGzipped": "matomo.js wurde komprimiert geliefert.",
        "MatomoJSCheckMIMEError": "matomo.js sollte mit einem 'application/javascript' Content-Typ geliefert werden. Sie verwenden '%s'.",
        "MatomoJSCheckNotGzipped": "matomo.js wird nicht im gzip-Format geliefert. Sie könnten gzip für .js-Dateien einrichten, da es zu einer Reduzierung der Dateigröße führt um bis zu 60 %.",
        "MatomoJSCheckUnknown": "Matomo konnte nicht feststellen, ob deine matomo.js richtig abgerufen wurde.",
        "NotificationText": "Sie haben das Plugin DiagnosticsExtended aktiviert. Es fügt dieser Seite weitere experimentelle Systemprüfungen (gekennzeichnet mit 🧪) hinzu, die bei den Problemen mit Ihrer Matomo-Instanz helfen können. Es kann trotzdem ein paar positive und negative Falschmeldungen geben, also nehmen Sie die Ergebnisse nicht zu ernst und prüfen Sie selbst nach. Bitte melden Sie Probleme mit dem Plugin im %1$sForum%2$s oder %3$serstelle ein GitHub Problem%4$s, damit die Prüfungen verbessert werden können.",
        "NotificationTitle": "Über DiagnosticsExtended",
        "OpcacheCheckInternedStrings": "Es scheint so, als haben Sie <code>opcache.interned_strings_buffer</code> auf einen Wert unter 8MB gesetzt, was zu niedrig sein könnte. Bitte erhöhen Sie den Wert auf 8 (Megabyte) oder mehr abhängig davon, wie viele PHP-Dateien Sie bereitstellen und wie viel Speicher auf Ihrem Server verfügbar ist.",
        "OpcacheCheckJIT": "Da Sie PHP 8 oder eine neuere Version verwenden, sollten Sie die den JIT-Compilers freigeben. Das könnte Matomo ein wenig beschleunigen. Außerdem wäre es hilfreich, wenn Sie uns über Ihre Erfahrungen nach der Freigabe von PHP JIT berichten könnten.",
        "OpcacheCheckMaxFiles": "Es scheint, dass Sie <code>opcache.max_accelerated_files</code> auf oder unter %s gesetzt haben, was zu niedrig sein könnte, um alle Matomo-Dateien im Cache zu halten, besonders wenn Sie auch andere PHP-Anwendungen betreiben. Bitte setzen Sie die Einstellung auf 7963, 16229 oder 32531, abhängig von der Anzahl der PHP-Dateien, die Ihr Webserver verwendet.",
        "OpcacheCheckMemory": "Es scheint, dass Sie <code>opcache.max_accelerated_files</code> auf oder unter 125MB gesetzt haben, was zu niedrig sein könnte, um alle Matomo-Dateien im Cache zu halten, besonders wenn Sie auch andere PHP-Anwendungen betreiben. Bitte setzen Sie die Einstellung auf 7963, 16229 oder 32531, abhängig von der Anzahl der PHP-Dateien, die Ihr Webserver verwendet.",
        "OpcacheCheckOpcacheDisabled": "Es scheint, dass OPcache in Ihrer PHP-Einrichtung deaktiviert ist. OPcache speichert den Bytecode von PHP-Skripten im Arbeitsspeicher und kann daher PHP um einiges beschleunigen, da er das Laden und Parsen von PHP-Dateien bei jeder Anfrage vermeidet. Prüfen Sie die <code>opcache.enable</code> php.ini-Einstellung für weitere Informationen.",
        "OpcacheCheckOpcacheEnabled": "Anscheinend ist OPcache aktiviert. %1$sMB von %2$sMB werden für PHP-Skripte verwendet (%3$s&percnt; verschwendet) und %4$sMB von %5$sMB werden für internierte Strings verwendet. %6$s&percnt; der Anfragen treffen auf den OPcache.",
        "OpcacheCheckSaveComments": "Es scheint, als ob Sie die <code>opcache.save_comments</code> Einstellung deaktiviert haben. Dadurch werden die Kommentare aus dem OPcache entfernt, wodurch dieser kleiner wird, aber Matomo wird nicht mehr funktionieren. Bitte setzen Sie <code>opcache.save_comments</code> auf <code>0</code>",
        "OpcacheCheckValidateTimestamps": "Sie haben <code>opcache.validate_timestamps</code> deaktiviert, so dass PHP nie überprüft, ob sich die tatsächlichen Dateien auf der Festplatte geändert haben, sondern weiterhin die im Cache gespeicherten Dateien verwendet. Theoretisch sollte das kein Problem sein, da Matomo den OPcache bei Updates und Installationen ungültig macht. Trotzdem sollten Sie sich das ansehen, wenn Sie auf ungewöhnliche Probleme stoßen.",
        "OpensslVersionCheckLabel": "OpenSSL Versionsprüfung",
        "OpensslVersionCheckNoOpenssl": "Ihre PHP Installation verwendet weder OpenSSL noch curl, deshalb gibt es nichts zu prüfen.",
        "OpensslVersionCheckNotOutdated": "Ihre OpenSSL-Version (%s) ist nicht sehr alt. Überprüfen Sie trotzdem, ob es dafür bekannte Sicherheitslücken gibt und aktualisieren Sie diese gegebenenfalls.",
        "OpensslVersionCheckOutdated": "Ihre OpenSSL-Version (%s) veraltet. Prüfen Sie, ob es dafür bekannte Sicherheitslücken gibt und aktualisieren Sie diese gegebenenfalls.",
        "PhpIniCheckIsDisabled": "%s ist aktiviert",
        "PhpIniCheckIsEnabled": "%s ist aktiviert",
        "PhpIniCheckLabel": "php.ini Optionen",
        "PhpIniCheckShouldBeDisabled": "%s sollte deaktiviert sein",
        "PhpIniCheckShouldBeEnabled": "%s sollte aktiviert sein",
        "PhpUserCheckLabel": "PHP läuft als root",
        "PhpUserCheckWarning": "PHP scheint als Root zu laufen. Wenn Sie Matomo außerhalb eines Docker-Containers verwenden, sollten Sie Ihre Einstellungen überprüfen.",
        "PhpVersionCheckEol": "Ihre PHP-Version (%1$s) erhält keine Sicherheitsunterstützung mehr durch das PHP-Team (seit %2$s). Sie sollten auf eine aktuellere Version umsteigen",
        "PhpVersionCheckLabel": "PHP Version",
        "PhpVersionCheckLatestVersion": "Sie verwenden die aktuellste Version von PHP %s",
        "PhpVersionCheckNoInformation": "Keine Informationen über Ihre PHP Version verfügbar (%s)",
        "PhpVersionCheckNotEol": "Ihre PHP-Version (%1$s) erhält bis %2$s Sicherheitsunterstützung durch das PHP-Team.",
        "PhpVersionCheckNotWorking": "Matomo konnte nicht prüfen, ob Ihre PHP Version auf dem neuesten Stand ist",
        "PhpVersionCheckOutdated": "Eine neuere PHP-Patch-Version (%1$s) ist verfügbar (Sie verwenden %2$s). Sie sollten möglichst zeitnah diese aktualisieren",
        "URLCheckConfigIni": "%s scheint teilweise öffentlich zu sein. Während Angreifer die Konfiguration jetzt nicht lesen können, ist die Datei öffentlich zugänglich und wenn Ihr Webserver aus irgendeinem Grund die Ausführung von PHP-Dateien in der Zukunft stoppt, kann jeder Ihre MySQL-Anmeldeinformationen und weitere Informationen lesen. Bitte überprüfen Sie Ihre Webserver-Konfiguration.",
        "URLCheckError": "%s sollte niemals öffentlich sein, ist es aber. Bitte prüfen Sie Ihre Webserverkonfiguration.",
        "URLCheckLabel": "Dateien, die nicht öffentlich sein sollten",
        "URLCheckLongErrorMessage": "Bitte prüfen Sie, ob Ihr Webserver die von Matomo generierten .htaccess-Dateien korrekt verarbeitet. Wenn Sie Nginx verwenden, werfen Sie bitte einen Blick in die %1$sofficial matomo-nginx config%2$s als Referenz für Dateien, die nicht öffentlich sein sollten. Die Angreifer könnten sonst in der Lage sein, sensible Daten zu lesen.",
        "URLCheckOk": "%s scheint nicht öffentlich erreichbar zu sein",
        "URLCheckSkipped": "Internet Features sind deaktiviert, deshalb wurde diese Prüfung übersprungen."
    }
}
