{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(εκτός αν ο διανομέας του εκτελέσιμου της MariaDB ενσωματώνει διορθώσεις ασφαλείας)",
        "BackportingDisclaimerPHP": "(εκτός αν ο διανομέας του εκτελέσιμου της PHP ενσωματώνει διορθώσεις ασφαλείας)",
        "CurlVersionCheckFailed": "Το Matomo δεν μπόρεσε να ελέγξει αν η έκδοσή σας της curl έχει ευπάθειες.",
        "CurlVersionCheckLabel": "έλεγχος έκδοσης curl",
        "CurlVersionCheckNoCurl": "Η εγκατάσταση της PHP σας δεν χρησιμοποιεί curl, οπότε δεν υπάρχει κάτι να ελεγχθεί.",
        "CurlVersionCheckUpToDate": "Φαίνεται να υπάρχουν ορισμένες γνωστές ευπάθειες στην έκδοσή σας του curl (%s).",
        "CurlVersionCheckVulnerable": "Η έκδοσή σας του curl (%s) ενδέχεται να είναι επισφαλής σε ορισμένες ευπάθειες (εκτός αν ο διανομέας του εκτελέσιμου του curl ενσωματώνει διορθώσεις ασφαλείας):",
        "DatabaseVersionCheckLabel": "Έκδοσης Βάσης Δεδομένων",
        "DatabaseVersionCheckMariaDBEol": "Η έκδοσή σας της MariaDB (%1$s) δεν λαμβάνει πλέον υποστήριξη για ασφάλεια από την ομάδα της MariaDB (από %2$s). Πρέπει να αναβαθμίσετε σε νεότερη έκδοση",
        "DatabaseVersionCheckMariaDBLatestVersion": "Χρησιμοποιείτε την τελευταία έκδοση της MariaDB %s.",
        "DatabaseVersionCheckMariaDBNotEol": "Η έκδοσή σας της MariaDB (%1$s) υποστηρίζεται για την ασφάλεια από την ομάδα της MariaDB μέχρι %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "Υπάρχει διαθέσιμη νεότερη έκδοση διόρθωσης (%1$s) της MariaDB (χρησιμοποιείτε %2$s %3$s).Πρέπει να αναβαθμίσετε σε αυτήν το συντομότερο",
        "MatomoJSCheckFailed": "Φαίνεται ότι δεν είναι δυνατή η σωστή λήψη του matomo.js.",
        "MatomoJSCheckFailedCurlTip": "δοκιμάστε να εκτελέσετε %s στο διακομιστή σας και να δείτε αν γίνεται επιτυχώς η λήψη του αρχείου",
        "MatomoJSCheckGzipped": "Το matomo.js διανέμεται συμπιεσμένο.",
        "MatomoJSCheckMIMEError": "Το matomo.js διανέμεται με Content-Type 'application/javascript'. Χρησιμοποιείτε '%s'.",
        "MatomoJSCheckNotGzipped": "Το matomo.js δεν διανέμεται με μορφή gzip. Καλό είναι να ορίσετε το gzip για τα αρχεία .js, καθώς μπορεί να μειώσει το μέγεθος του αρχείου μέχρι και 60 %.",
        "MatomoJSCheckUnknown": "Το Matomo δεν μπόρεσε να ελέγξει αν το matomo.js μπορεί να ληφθεί σωστά.",
        "NotificationText": "Έχετε ενεργοποιήσει το πρόσθετο DiagnosticsExtended. Προσθέτει μερικούς νέους πειραματικούς ελέγχους συστήματος (μαρκαρισμένοι με 🧪) στη σελίδα αυτή που μπορεί να σας βοηθήσουν να εντοπίσετε προβλήματα με το στιγμιότυπό σας του Matomo. Ενδέχεται να υπάρχουν ορισμένα ψευδώς θετικά ή αρνητικά, οπότε μη λάβετε τα αποτελέσματα όπως είναι, αλλά ελέγξτε πρώτα αν κάτι είναι λάθος. Αναφέρετε προβλήματα για το πρόσθετο στο %1$sφόρουμ%2$s ή %3$sανοίξτε ένα θέμα στο GitHub%4$s προκειμένου να βελτιωθούν οι έλεγχοι.",
        "NotificationTitle": "Σχετικά με το DiagnosticsExtended",
        "OpcacheCheckInternedStrings": "Φαίνεται ότι έχετε ορίσει το <code>opcache.interned_strings_buffer</code> σε κάτω από 8MB που μπορεί να είναι λίγο. Αυξήστε την τιμή σε 8 (Megabyte) ή περισσότερο ανάλογα με το πόσα αρχεία PHP εξυπηρετείτε και πόση διαθέσιμη μνήμη έχει ο διακομιστής σας.",
        "OpcacheCheckJIT": "Καθώς χρησιμοποιείτε PHP έκδοσης 8 ή νεότερη, προτείνεται να ενεργοποιήσετε τον μεταγλωττιστή JIT. Ενδέχεται να αυξήσει την ταχύτητα του Matomo λίγο. Θα ήταν επίσης καλό να αναφέρετε την τυχόν εμπειρία σας μετά την ενεργοποίηση του PHP JIT.",
        "OpcacheCheckMaxFiles": "Φαίνεται ότι έχετε ορίσει το <code>opcache.max_accelerated_files</code> σε κάτω από %s που μπορεί να είναι λίγο για να διατηρούνται όλα τα αρχεία του Matomo στην λανθάνουσα μνήμη, ειδικά αν έχετε και άλλες εφαρμογές PHP. Αυξήστε την τιμή σε 7963, 16229 ή 32531 ανάλογα με τον αριθμό των αρχείων PHP που χρησιμοποιεί ο διακομιστής σας.",
        "OpcacheCheckMemory": "Φαίνεται ότι έχετε ορίσει το <code>opcache.memory_consumption</code> σε κάτω από 128MB που μπορεί να είναι λίγο για να διατηρούνται όλα τα αρχεία του Matomo στην λανθάνουσα μνήμη, ειδικά αν έχετε και άλλες εφαρμογές PHP. Αυξήστε την τιμή σε 128 ή 256 (Megabyte) ανάλογα με τον αριθμό των αρχείων PHP και τη διαθέσιμη μνήμη που έχει ο διακομιστής σας.",
        "OpcacheCheckOpcacheDisabled": "Φαίνεται ότι έχετε ανενεργό το OPcache στην παραμετροποίηση της PHP σας. Το OPcache αποθηκεύει τον ενδιάμεσο κώδικα των σεναρίων PHP στη μνήμη, οπότε μπορεί να αυξήσει σημαντικά την PHP, καθώς αποφεύγει να φορτώσει και να διαβάσει τα αρχεία PHP σε κάθε αίτηση. Δείτε τη ρύθμιση <code>opcache.enable</code> στο αρχείο php.ini για περισσότερες λεπτομέρειες.",
        "OpcacheCheckOpcacheEnabled": "Φαίνεται ότι το OPcache είναι ενεργοποιημένο. %1$sMB από %2$sMB χρησιμοποιούνται για τα σενάρια της PHP (%3$s&percnt; χάνεται) και %4$sMB από %5$sMB χρησιμοποιούνται για τα interned strings. %6$s&percnt; των αιτήσεων εξυπηρετούνται από το OPcache.",
        "OpcacheCheckSaveComments": "Φαίνεται ότι έχετε ανενεργή τη ρύθμιση <code>opcache.save_comments</code>. Αυτό αφαιρεί τα σχόλια από το OPcache, κάνοντας την πιο μικρή, αλλά δημιουργεί πρόβλημα στο Matomo. Ρυθμίστε το <code>opcache.save_comments</code> σε <code>0</code>",
        "OpcacheCheckValidateTimestamps": "Φαίνεται ότι έχετε ανενεργό το <code>opcache.validate_timestamps</code> που σημαίνει ότι η PHP δε θα ελέγχει ποτέ αν τα αρχεία στο δίσκο έχουν αλλάξει και θα συνεχίσει να χρησιμοποιεί αυτά στη λανθάνουσα μνήμη. Θεωρητικά, δεν υπάρχει πρόβλημα, καθώς το Matomo καθαρίζει το OPcache κατά τη διάρκεια των ενημερώσεων και εγκαταστάσεων, αλλά δείτε το, γιατί μπορεί να αντιμετωπίσετε περίεργα προβλήματα.",
        "OpensslVersionCheckLabel": "Έλεγχος έκδοσης OpenSSL",
        "OpensslVersionCheckNoOpenssl": "Η παραμετροποίηση της PHP δεν χρησιμοποιεί OpenSSL ή curl, οπότε δεν υπάρχει έλεγχος να γίνει.",
        "OpensslVersionCheckNotOutdated": "Η έκδοσή σας του OpenSSL (%s) είναι πραγματικά παλιά. Ωστόσο, ελέγξτε αν υπάρχουν γνωστές ευπάθειες για αυτή και ενημερώστε τη αν είναι απαραίτητο.",
        "OpensslVersionCheckOutdated": "Η έκδοσή σας του OpenSSL (%s) είναι πραγματικά παλιά. Ελέγξτε αν υπάρχουν γνωστές ευπάθειες για αυτή και ενημερώστε τη αν είναι απαραίτητο.",
        "PhpIniCheckIsDisabled": "Το %s είναι ενεργοποιημένο",
        "PhpIniCheckIsEnabled": "Το %s είναι ενεργοποιημένο",
        "PhpIniCheckLabel": "επιλογές php.ini",
        "PhpIniCheckShouldBeDisabled": "Το %s πρέπει να είναι απενεργοποιημένο",
        "PhpIniCheckShouldBeEnabled": "Το %s πρέπει να είναι ενεργοποιημένο",
        "PhpUserCheckLabel": "Η PHP εκτελείται ως root",
        "PhpUserCheckWarning": "Η PHP φαίνεται να εκτελείται ως root. Εκτός και αν χρησιμοποιείτε το Matomo σε ένα περιέκτη docker, θα πρέπει να ελέγξτε την παραμετροποίησή σας.",
        "PhpVersionCheckEol": "Η έκδοση της PHP σας (%1$s) δεν έχει υποστήριξη για ασφάλεια από την ομάδα της PHP πλέον (από %2$s). Πρέπει να αναβαθμίσετε σε νεότερη έκδοση",
        "PhpVersionCheckLabel": "Έκδοση PHP",
        "PhpVersionCheckLatestVersion": "Χρησιμοποιείτε την τελευταία έκδοση της PHP %s",
        "PhpVersionCheckNoInformation": "Δεν υπάρχουν πληροφορίες για την έκδοσή σας της PHP (%s)",
        "PhpVersionCheckNotEol": "Η έκδοσή σας της PHP (%1$s) έχει υποστήριξη για ασφάλεια από την ομάδα της PHP μέχρι %2$s.",
        "PhpVersionCheckNotWorking": "Το Matomo δεν μπόρεσε να ελέγξει αν η έκδοσή σας της PHP είναι ενημερωμένη",
        "PhpVersionCheckOutdated": "Υπάρχει νεότερη έκδοση της PHP σε επίπεδο patch (%1$s) διαθέσιμη (χρησιμοποιείτε την %2$s). Πρέπει να την αναβαθμίσετε το συντομότερο δυνατόν",
        "URLCheckConfigIni": "Το %s φαίνεται να είναι ημι-δημόσιο. Παρόλο που οι επιτιθέμενοι δεν μπορούν να διαβάσουν τώρα την παραμετροποίηση, το αρχείο είναι δημόσια διαθέσιμο και αν για κάποιο λόγο στο μέλλον ο διακομιστής σας δεν εκτελεί τα αρχεία PHP, όλοι θα μπορούν να διαβάσουν τα διαπιστευτήρια για τη MySQL και άλλα πολλά. Ελέγξτε την ρύθμιση του διακομιστή.",
        "URLCheckError": "Το %s δεν πρέπει να είναι ποτέ δημόσιο, αλλά φαίνεται ότι είναι. Ελέγξτε την παραμετροποίηση του διακομιστή.",
        "URLCheckLabel": "Αρχεία που δε θα έπρεπε να είναι δημόσια",
        "URLCheckLongErrorMessage": "Ελέγξτε ότι ο διακομιστής σας διαβάζει σωστά τα αρχεία .htaccess που δημιουργεί το Matomo. Αν χρησιμοποιείτε Nginx, δείτε στην τεκμηρίωση για το %1$sεπίσημο αρχείο παραμετροποίησης του matomo-nginx%2$s για να δείτε ποια αρχεία δεν πρέπει να είναι δημόσια.<br> Διαφορετικά οι επιτιθέμενοι θα μπορούν να διαβάσουν ευαίσθητες πληροφορίες.",
        "URLCheckOk": "Το %s δε φαίνεται να είναι δημόσια προσπελάσιμο",
        "URLCheckSkipped": "Οι ιδιότητες για το internet είναι ανενεργές, οπότε αυτός ο έλεγχος δεν γίνεται."
    }
}
