{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(non eta zure MariaDB bitarraren banatzaileak ez dituen segurtasun adabakiak atzeraeraginez ezartzen)",
        "BackportingDisclaimerPHP": "(non eta zure PHP bitarraren banatzaileak ez dituen segurtasun adabakiak atzeraeraginez ezartzen)",
        "CurlVersionCheckFailed": "Matomok ezin izan du egiaztatu zure curl bertsioak segurtasun ahultasunik duen ala ez.",
        "CurlVersionCheckLabel": "curl bertsioaren egiaztapena",
        "CurlVersionCheckNoCurl": "Zure PHP konfigurazioak ez du curl erabiltzen, beraz ez dago zer egiaztatu.",
        "CurlVersionCheckUpToDate": "Dirudienez ez dago segurtasun ahultasun ezagunik zure curl bertsioan (%s).",
        "CurlVersionCheckVulnerable": "Zure curl bertsioak (%s) segurtasun ahultasun hauek izan ditzake (non eta zure curl bitarraren banatzaileak ez dituen segurtasun adabakiak atzeraeraginez ezartzen):",
        "DatabaseVersionCheckLabel": "Datu-basearen bertsioa",
        "DatabaseVersionCheckMariaDBEol": "Zure MariaDB bertsioak (%1$s) ez du jada MariaDB taldearen segurtasun euskarririk (%2$s bertsiotik). Bertsio berriago batera eguneratu beharko zenuke",
        "DatabaseVersionCheckMariaDBLatestVersion": "MariaDBren azken bertsioa erabiltzen ari zara: %s.",
        "DatabaseVersionCheckMariaDBNotEol": "Zure MariaDB bertsioak (%1$s) MariaDB taldearen segurtasun euskarria du data hau arte: %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "MariaDBren adabaki bertsio berri bat (%1$s) eskuragarri dago (%2$s/%3$s erabiltzen ari zara). Ahal bezain laster eguneratu beharko zenuke",
        "MatomoJSCheckFailed": "Dirudienez ezin da matomo.js behar bezala eskuratu.",
        "MatomoJSCheckFailedCurlTip": "saiatu %s exekutatzen zure zerbitzarian eta ikusi ea fitxategia eskuratu dezakeen",
        "MatomoJSCheckGzipped": "matomo.js konprimatuta banatzen da.",
        "MatomoJSCheckMIMEError": "matomo.js 'application/javascript' eduki-mota erabiliz banatu behar da. '%s' erabiltzen ari zara.",
        "MatomoJSCheckNotGzipped": "matomo.js ez da gzip-ekin konprimatuta banatzen. gzip konfiguratu dezakezu .js fitxategientzat, fitxategien tamaina %60 txikiagotu baitezake.",
        "MatomoJSCheckUnknown": "Matomok ezin izan du egiaztatu zure matomo.js behar bezala eskura daitekeen.",
        "NotificationText": "DiagnosticsExtended plugina gaituta duzu. Sistemaren egiaztapen esperimental batzuk (🧪 ikurrarekin markatuak) gehitzen dizkio orri honi. Lagungarriak izan daitezke zure Matomo instantziaren arazoak aurkitzeko, baina positibo eta negatibo faltsu batzuk izan ditzakete. Beraz ez hartu emaitzak egiatzat. Egiaztatu zuk zeuk zerbait gaizki dabilen. Eskertuko genizuke pluginarekin arazorik izanez gero %1$sforoan%2$s edo %3$sGitHub-en%4$s jakinaraztea, egiaztapenak hobetu ditzagun.",
        "NotificationTitle": "DiagnosticsExtended-i buruz",
        "OpcacheCheckInternedStrings": "Dirudienez <code>opcache.interned_strings_buffer</code> 8MBetik behera ezarri duzu. Hori baxuegia izan daiteke. Balioa 8 Megabyte edo gehiagora handitu beharko zenuke, zerbitzatzen dituzun PHP fitxategi kopuruaren eta zerbitzarian duzun memoria kopuruaren arabera.",
        "OpcacheCheckJIT": "PHP 8 edo berriagoa erabiltzen ari bazara, JIT konpiladorea gaitu dezakezu. Matomoren abiadura pixka bat handitu dezake. Eskertuko genizuke PHP JIT gaitu ondoren dituzun esperientzien berri ematea.",
        "OpcacheCheckMaxFiles": "Dirudienez <code>opcache.max_accelerated_files</code> %s edo gutxiago bezala ezarri duzu. Hori baxuegia izan daiteke Matomoren fitxategi guztiak cache-an mantentzeko. Bereziki beste PHP aplikazio batzuk ostatatzen badituzu. Ezarri 7963, 16229 edo 32531 balioa, zure web zerbitzariak erabiltzen duen PHP fitxategi kopuruaren arabera.",
        "OpcacheCheckMemory": "Dirudienez <code>opcache.memory_consumption</code> 128MBetik behera ezarri duzu. Hori baxuegia izan daiteke Matomoren fitxategi guztiak cache-an mantentzeko. Bereziki beste PHP aplikazio batzuk ostatatzen badituzu. Ezarri 128 edo 256 (Megabyte) balioa, zerbitzatzen duzun PHP fitxategi kopuruaren eta zerbitzarian erabilgarri duzun memoriaren arabera.",
        "OpcacheCheckOpcacheDisabled": "Dirudienez OPcache desgaituta dago zure PHP konfigurazioan. OPcachek memorian gordetzen du PHP script-en bytecode-a eta hori dela eta PHPren abiadura dezente bizkortu dezake, eskaera bakoitzean PHP fitxategiak kargatu eta analizatzea saihesten baitu. Ikusi <code>opcache.enable</code> php.ini ezarpena informazio gehiagorako.",
        "OpcacheCheckOpcacheEnabled": "Dirudienez OPcache gaituta dago. PHP scriptek %1$sMB / %2$sMB erabiltzen dute (ehuneko %3$s alferrik galduta) eta barneko kateek %4$sMB / %5$sMB erabiltzen dute. Eskaeren ehuneko %6$s hartzen du OPcachek.",
        "OpcacheCheckSaveComments": "Dirudienez <code>opcache.save_comments</code> ezarpena desgaitu duzu. Horrek iruzkinak kentzen ditu, OPcache txikiago eginez, baina Matomo puskatzen du. Ezarri <code>opcache.save_comments</code> <code>0</code> baliora",
        "OpcacheCheckValidateTimestamps": "Dirudienez <code>opcache.validate_timestamps</code> desgaitu duzu. Horrek esan nahi du PHPk ez duela inoiz egiaztatuko diskoko fitxategiak aldatu diren eta ondorioz cache-an gordetakoak erabiltzen jarraituko du. Teorian honek ez luke arazoa izan behar, Matomok OPcache baliogabetzen baitu eguneraketa eta instalazioetan, baina kontuan izan beharko zenuke arazo arrarorik baduzu.",
        "OpensslVersionCheckLabel": "OpenSSL bertsioa egiaztatzea",
        "OpensslVersionCheckNoOpenssl": "Zure PHP konfigurazioak ez du OpenSSL edo curl erabiltzen. Beraz ez dago zer egiaztaturik.",
        "OpensslVersionCheckNotOutdated": "Zure OpenSSL bertsioa (%s) ez da oso zaharra. Hala ere, egiaztatu ea segurtasun ahultasunik baduen eta eguneratu behar izanez gero.",
        "OpensslVersionCheckOutdated": "Zure OpenSSL bertsioa (%s) nahiko zaharra da. Egiaztatu ea segurtasun ahultasun ezagunik baduen eta behar izanez gero eguneratu.",
        "PhpIniCheckIsDisabled": "%s gaituta dago",
        "PhpIniCheckIsEnabled": "%s gaituta dago",
        "PhpIniCheckLabel": "php.ini aukerak",
        "PhpIniCheckShouldBeDisabled": "%s desgaitu behar litzateke",
        "PhpIniCheckShouldBeEnabled": "%s gaitu behar litzateke",
        "PhpUserCheckLabel": "PHP root bezala exekutatzen da",
        "PhpUserCheckWarning": "Dirudienez PHP root bezala exekutatzen da. Matomo Docker edukiontzi batean ez badago, konfigurazioa egiaztatu beharko zenuke.",
        "PhpVersionCheckEol": "Zure PHP bertsioak (%1$s) ez du jada PHP taldearen segurtasun euskarririk (%2$s bertsiotik). Bertsio berriago batera eguneratu beharko zenuke",
        "PhpVersionCheckLabel": "PHP bertsioa",
        "PhpVersionCheckLatestVersion": "PHPren azken bertsioa erabiltzen ari zara: %s",
        "PhpVersionCheckNoInformation": "Ez dago informaziorik zure PHP bertsioari buruz (%s)",
        "PhpVersionCheckNotEol": "Zure PHP bertsioak (%1$s) PHP taldearen segurtasun eguneraketak jasoko ditu data hau arte: %2$s.",
        "PhpVersionCheckNotWorking": "Matomok ezin izan du egiaztatu zure PHP bertsioa eguneratuta dagoen",
        "PhpVersionCheckOutdated": "PHPren adabaki bertsio berriago bat (%1$s) eskuragarri dago (%2$s erabiltzen ari zara). Ahalik eta azkarren eguneratu beharko zenuke"
    }
}
