{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(à moins que le distributeur de votre binaire MariaDB ne rétroporte des correctifs de sécurité)",
        "BackportingDisclaimerPHP": "(à moins que le distributeur de votre binaire PHP ne rétroporte des correctifs de sécurité)",
        "CurlVersionCheckFailed": "Matomo n'a pas pu vérifier si votre version curl présente des vulnérabilités.",
        "CurlVersionCheckLabel": "vérification de la version curl",
        "CurlVersionCheckNoCurl": "Votre configuration PHP n'utilise pas curl, il n'y a donc rien à vérifier.",
        "CurlVersionCheckUpToDate": "Il semble qu'il n'y ait aucune vulnérabilité connue dans votre version curl (%s).",
        "CurlVersionCheckVulnerable": "Votre version de curl (%s) peut être vulnérable à ces vulnérabilités (à moins que le distributeur de votre binaire curl ne rétroporte des correctifs de sécurité) :",
        "DatabaseVersionCheckLabel": "Version de la base de données",
        "DatabaseVersionCheckMariaDBEol": "Votre version MariaDB (%1$s) ne reçoit plus de support de sécurité par l'équipe MariaDB (depuis %2$s). Vous devriez mettre à jour vers une version plus récente",
        "DatabaseVersionCheckMariaDBLatestVersion": "Vous utilisez la dernière version de MariaDB %s.",
        "DatabaseVersionCheckMariaDBNotEol": "Votre version MariaDB (%1$s) bénéficie du support de sécurité de l'équipe MariaDB jusqu'au %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "Une version plus récente du correctif MariaDB (%1$s) est disponible (vous utilisez %2$s/%3$s). Vous devriez le mettre à jour dès que possible",
        "MatomoJSCheckFailed": "Il semble que matomo.js ne puisse pas être récupéré correctement.",
        "MatomoJSCheckFailedCurlTip": "essayez d'exécuter %s sur votre serveur et voyez s'il est capable de récupérer le fichier avec succès",
        "MatomoJSCheckGzipped": "matomo.js est livré compressé.",
        "MatomoJSCheckMIMEError": "matomo.js doit être livré avec un Content-Type 'application/javascript'. Vous utilisez '%s'.",
        "MatomoJSCheckNotGzipped": "matomo.js n'est pas livré gzippé. Vous voudrez peut-être configurer gzip pour les fichiers .js car cela peut réduire la taille du fichier jusqu'à 60 %.",
        "MatomoJSCheckUnknown": "Matomo n'a pas pu vérifier si votre matomo.js peut être récupéré correctement.",
        "NotificationText": "Vous avez activé le plugin DiagnosticsExtended. Il ajoute quelques vérifications de système expérimentales supplémentaires (marquées d'uN 🧪) à cette page qui pourraient vous aider à trouver des problèmes avec votre instance Matomo. Il peut y avoir encore quelques faux positifs et faux négatifs, alors ne prenez pas les résultats pour la vérité, mais vérifiez vous-même si quelque chose ne va pas. Veuillez signaler les problèmes avec le plugin au %1$sforum%2$s ou %3$scréer un problème GitHub%4$s afin que les vérifications puissent être améliorées.",
        "NotificationTitle": "À propos du diagnostic étendu",
        "OpcacheCheckInternedStrings": "Il semble que vous ayez défini <code>opcache.interned_strings_buffer</code> en dessous de 8 Mo, ce qui pourrait être un peu faible. Veuillez augmenter la valeur à 8 (Mégaoctet) ou plus selon le nombre de fichiers PHP que vous servez et la quantité de mémoire disponible sur votre serveur.",
        "OpcacheCheckJIT": "Comme vous utilisez PHP 8 ou une version plus récente, vous voudrez peut-être envisager d'activer le compilateur JIT. Cela pourrait peut-être accélérer un peu Matomo. Ce serait également formidable si vous pouviez rendre compte de vos expériences après avoir activé PHP JIT.",
        "OpcacheCheckMaxFiles": "Il semble que vous ayez défini <code>opcache.max_accelerated_files</code> sur ou en dessous de %s, ce qui pourrait être trop bas pour conserver tous les fichiers Matomo dans le cache, surtout si vous hébergez également d'autres applications PHP. Veuillez définir l'option sur 7963, 16229 ou 32531 en fonction du nombre de fichiers PHP utilisés par votre serveur Web.",
        "OpcacheCheckMemory": "Il semble que vous ayez défini <code>opcache.memory_consumption</code> en dessous de 128 Mo, ce qui pourrait être trop faible pour conserver tous les fichiers Matomo dans le cache, surtout si vous hébergez également d'autres applications PHP. Veuillez augmenter la valeur à 128 ou 256 (Mégaoctet) en fonction du nombre de fichiers PHP que vous servez et de la quantité de mémoire disponible sur votre serveur.",
        "OpcacheCheckOpcacheDisabled": "Il semble qu'OPcache soit désactivé dans votre configuration PHP. OPcache stocke le bytecode des scripts PHP en mémoire et est donc capable d'accélérer considérablement PHP car il évite de charger et d'analyser les fichiers PHP à chaque requête. Vérifiez le paramètre php.ini <code>opcache.enable</code> pour plus d'informations.",
        "OpcacheCheckOpcacheEnabled": "Il semble qu'OPcache soit activé. %1$sMB de %2$sMB sont utilisés pour les scripts PHP (%3$s&percnt; gaspillés) et %4$sMB de %5$sMB sont utilisés pour les chaînes internes. %6$s% des requêtes ont atteint l'OPcache.",
        "OpcacheCheckSaveComments": "Il semble que vous ayez désactivé le paramètre <code>opcache.save_comments</code>. Cela supprime les commentaires de l'OPcache, le rendant plus petit, mais casse Matomo. Veuillez définir <code>opcache.save_comments</code> sur <code>0</code>",
        "OpcacheCheckValidateTimestamps": "Il semble que vous ayez désactivé <code>opcache.validate_timestamps</code>, ce qui signifie que PHP ne vérifiera jamais si les fichiers réels sur le disque ont changé, mais continuera à utiliser ceux mis en cache. En théorie, cela ne devrait pas poser de problème car Matomo invalide l'OPcache sur les mises à jour et les installations, mais vous voudrez peut-être toujours vous renseigner si vous rencontrez des problèmes étranges.",
        "OpensslVersionCheckLabel": "Vérification de la version OpenSSL",
        "OpensslVersionCheckNoOpenssl": "Votre configuration PHP n'utilise pas OpenSSL ou curl, il n'y a donc rien à vérifier.",
        "OpensslVersionCheckNotOutdated": "Votre version OpenSSL (%s) n'est pas vraiment ancienne. Néanmoins, vérifiez s'il existe des vulnérabilités connues pour celui-ci et mettez le à jour si nécessaire.",
        "OpensslVersionCheckOutdated": "Votre version OpenSSL (%s) est assez ancienne. Vérifiez s'il existe des vulnérabilités connues et mettez-le à jour si nécessaire.",
        "PhpIniCheckIsDisabled": "%s est activé",
        "PhpIniCheckIsEnabled": "%s est activé",
        "PhpIniCheckLabel": "options php.ini",
        "PhpIniCheckShouldBeDisabled": "%s devrait être désactivé",
        "PhpIniCheckShouldBeEnabled": "%s devrait être activé",
        "PhpUserCheckLabel": "PHP exécuté en tant que root",
        "PhpUserCheckWarning": "PHP semble fonctionner en tant que root. À moins que vous n'utilisiez Matomo dans un conteneur Docker, vous devez vérifier votre configuration.",
        "PhpVersionCheckEol": "Votre version PHP (%1$s) ne bénéficie plus du support de sécurité de l'équipe PHP (depuis %2$s). Vous devriez mettre à jour vers une version plus récente",
        "PhpVersionCheckLabel": "version PHP",
        "PhpVersionCheckLatestVersion": "Vous utilisez la dernière version de PHP %s",
        "PhpVersionCheckNoInformation": "Aucune information n'est connue sur votre version PHP (%s)",
        "PhpVersionCheckNotEol": "Votre version PHP (%1$s) bénéficie d'un support de sécurité par l'équipe PHP jusqu'au %2$s.",
        "PhpVersionCheckNotWorking": "Matomo n'a pas pu vérifier si votre version PHP est à jour",
        "PhpVersionCheckOutdated": "Une version plus récente du correctif PHP (%1$s) est disponible (vous utilisez %2$s). Vous devriez le mettre à jour dès que possible",
        "URLCheckConfigIni": "%s semble être semi-public. Bien que les attaquants ne puissent pas lire la configuration maintenant, le fichier est accessible au public et si, pour une raison quelconque, votre serveur Web cesse d'exécuter des fichiers PHP à l'avenir, tout le monde peut lire vos informations d'identification MySQL et plus encore. Veuillez vérifier la configuration de votre serveur Web.",
        "URLCheckError": "%s ne devrait jamais être public, mais semble l'être. Veuillez vérifier la configuration de votre serveur Web.",
        "URLCheckLabel": "Fichiers qui ne devraient pas être publics",
        "URLCheckLongErrorMessage": "Veuillez vérifier si votre serveur Web traite correctement les fichiers .htaccess générés par Matomo. Si vous utilisez Nginx, veuillez consulter la %1$sconfiguration officielle de matomo-nginx%2$s pour référence pour les fichiers qui ne devraient pas être publics.<br> Sinon, les attaquants pourraient être en mesure de lire des données sensibles.",
        "URLCheckOk": "%s ne semble pas accessible au public",
        "URLCheckSkipped": "Les fonctionnalités Internet sont désactivées, cette vérification est donc ignorée."
    }
}
