{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(kecuali distributor biner MariaDB Anda mendukung patch keamanan)",
        "BackportingDisclaimerPHP": "(kecuali distributor biner PHP Anda mendukung patch keamanan)",
        "CurlVersionCheckFailed": "Matomo tidak dapat memeriksa apakah versi curl Anda memiliki kerentanan.",
        "CurlVersionCheckLabel": "cek versi curl",
        "CurlVersionCheckNoCurl": "Pengaturan PHP Anda tidak menggunakan curl, jadi tidak ada yang perlu diperiksa.",
        "CurlVersionCheckUpToDate": "Sepertinya tidak ada kerentanan yang diketahui dalam versi curl Anda (%s).",
        "CurlVersionCheckVulnerable": "Versi curl Anda (%s) mungkin rentan terhadap kerentanan ini (kecuali distributor biner curl Anda mendukung patch keamanan):",
        "DatabaseVersionCheckLabel": "Versi basis data",
        "DatabaseVersionCheckMariaDBEol": "Versi MariaDB Anda (%1$s) tidak lagi menerima dukungan keamanan dari tim MariaDB (sejak %2$s). Anda harus memperbarui ke versi yang terbaru",
        "DatabaseVersionCheckMariaDBLatestVersion": "Anda menggunakan MariaDB versi terbaru %s.",
        "DatabaseVersionCheckMariaDBNotEol": "Versi MariaDB Anda (%1$s) menerima dukungan keamanan dari tim MariaDB hingga %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "Sudah tersedia versi patch MariaDB yang lebih baru (%1$s) (Anda menggunakan %2$s/%3$s). Anda harus memperbaruinya secepatnya",
        "MatomoJSCheckFailed": "Sepertinya matomo.js tidak bisa diambil dengan benar.",
        "MatomoJSCheckFailedCurlTip": "coba jalankan %s di server Anda dan lihat apakah berkas tersebut berhasil diambil",
        "MatomoJSCheckGzipped": "matomo.js telah dikirimkan secara terkompresi.",
        "MatomoJSCheckMIMEError": "matomo.js harus dikirimkan dengan Tipe-Konten 'aplikasi/javascript'. Anda menggunakan '%s'.",
        "MatomoJSCheckNotGzipped": "matomo.js tidak dikirim dalam bentuk gzip. Anda mungkin ingin menyiapkan gzip untuk berkas .js karena dapat mengurangi ukuran berkas hingga 60 %.",
        "MatomoJSCheckUnknown": "Matomo tidak dapat memeriksa apakah matomo.js Anda dapat diambil dengan benar.",
        "NotificationText": "Anda telah mengaktifkan pengaya DiagnosticsExtended. Ini menambahkan beberapa pemeriksaan sistem eksperimental (ditandai dengan 🧪) ke halaman ini yang mungkin dapat membantu Anda untuk menemukan masalah di Matomo Anda. Mungkin masih ditemukan beberapa positif palsu dan negatif palsu, jadi jangan menganggap hasilnya sebagai sebuah kebenaran, tetapi periksa sendiri jika ada yang salah. Laporkan masalah pengaya ke %1$sforum%2$s atau %3$sbuat isu GitHub%4$s sehingga pemeriksaan dapat ditingkatkan.",
        "NotificationTitle": "Tentang DiagnosticsExtended",
        "OpcacheCheckInternedStrings": "Sepertinya Anda telah menyetel <code>opcache.interned_strings_buffer</code> di bawah 8MB yang mana, mungkin sedikit rendah. Silakan tingkatkan nilainya menjadi 8 (Megabyte) atau lebih tergantung pada berapa banyak berkas PHP yang Anda layani dan berapa banyak memori yang tersedia di server Anda.",
        "OpcacheCheckJIT": "Saat Anda menggunakan PHP 8 atau yang lebih baru, Anda mungkin ingin mempertimbangkan untuk mengaktifkan kompiler JIT. Itu mungkin bisa sedikit mempercepat Matomo. Akan sangat bagus jika Anda dapat melaporkan kembali pengalaman apa pun setelah mengaktifkan PHP JIT.",
        "OpcacheCheckMaxFiles": "Sepertinya Anda telah menyetel <code>opcache.max_accelerated_files</code> ke atau di bawah %s yang mungkin terlalu rendah untuk menyimpan semua file Matomo dalam tembolok, terutama jika Anda juga menghosting aplikasi PHP lainnya. Harap atur opsi ke 7963, 16229, atau 32531 tergantung pada jumlah berkas PHP yang digunakan di server web Anda.",
        "OpcacheCheckMemory": "Sepertinya Anda telah menyetel <code>opcache.memory_consumption</code> di bawah 128MB yang mungkin terlalu rendah untuk menyimpan semua file Matomo dalam tembolok, terutama jika Anda juga menghosting aplikasi PHP lainnya. Harap tingkatkan nilainya menjadi 128 atau 256 (Megabyte) tergantung pada berapa banyak berkas PHP yang Anda layani dan berapa banyak memori yang tersedia di server Anda.",
        "OpcacheCheckOpcacheDisabled": "Sepertinya OPcache dinonaktifkan di pengaturan PHP Anda. OPcache menyimpan bytecode skrip PHP dalam memori dan mampu mempercepat PHP sedikit karena menghindari pemuatan dan penguraian berjas PHP pada setiap permintaan. Periksa pengaturan <code>opcache.enable</code> php.ini untuk informasi lebih lanjut.",
        "OpcacheCheckOpcacheEnabled": "Sepertinya OPcache diaktifkan. %1$sMB dari %2$sMB digunakan untuk skrip PHP (%3$s&percnt; terbuang) dan %4$sMB dari %5$sMB digunakan untuk string yang diinternalisasi. %6$s&percnt; permintaan mencapai OPcache.",
        "OpcacheCheckSaveComments": "Sepertinya Anda telah menonaktifkan setelan <code>opcache.save_comments</code>. Ini akan menghapus komentar dari OPcache sehingga membuatnya menjadi lebih kecil, tetapi dapat merusak Matomo. Harap setel <code>opcache.save_comments</code> ke <code>0</code>",
        "OpcacheCheckValidateTimestamps": "Sepertinya Anda telah menonaktifkan <code>opcache.validate_timestamps</code> yang berarti bahwa PHP tidak akan pernah memeriksa apakah berkas aktual pada penyimpanan telah berubah atau tidak, tetapi terus menggunakan berkas yang di-cache. Secara teori, ini seharusnya tidak menjadi masalah karena Matomo membatalkan OPcache pada pembaruan dan pemasangan, tetapi Anda mungkin masih ingin melihat ini jika Anda mengalami masalah aneh.",
        "OpensslVersionCheckLabel": "Pemeriksaan versi OpenSSL",
        "OpensslVersionCheckNoOpenssl": "Pengaturan PHP Anda tidak menggunakan OpenSSL atau curl, jadi tidak ada yang perlu diperiksa.",
        "OpensslVersionCheckNotOutdated": "Versi OpenSSL Anda (%s) tidak terlalu tua. Namun demikian, periksalah apakah ada kerentanan yang diketahui atau tidak dan perbarui jika perlu.",
        "OpensslVersionCheckOutdated": "Versi OpenSSL Anda (%s) sudah cukup lama. Periksalah apakah ada kerentanan atau tidak dan perbarui jika perlu.",
        "PhpIniCheckIsDisabled": "%s diaktifkan",
        "PhpIniCheckIsEnabled": "%s diaktifkan",
        "PhpIniCheckLabel": "opsi php.ini",
        "PhpIniCheckShouldBeDisabled": "%s harus dinonaktifkan",
        "PhpIniCheckShouldBeEnabled": "%s harus diaktifkan",
        "PhpUserCheckLabel": "PHP berjalan sebagai root",
        "PhpUserCheckWarning": "PHP tampaknya berjalan sebagai root. Kecuali Anda menggunakan Matomo di dalam sebuah kontainer docker, Anda harus memeriksa pengaturan Anda.",
        "PhpVersionCheckEol": "Versi PHP Anda (%1$s) tidak lagi menerima dukungan keamanan dari tim PHP (sejak %2$s). Anda harus memperbarui ke versi yang lebih baru",
        "PhpVersionCheckLabel": "Versi PHP",
        "PhpVersionCheckLatestVersion": "Anda menggunakan versi PHP terbaru %s",
        "PhpVersionCheckNoInformation": "Tidak ada informasi yang diketahui tentang versi PHP Anda (%s)",
        "PhpVersionCheckNotEol": "Versi PHP Anda (%1$s) menerima dukungan keamanan dari tim PHP hingga %2$s.",
        "PhpVersionCheckNotWorking": "Matomo tidak dapat memeriksa apakah versi PHP Anda mutakhir atau tidak",
        "PhpVersionCheckOutdated": "Ada versi patch PHP yang lebih baru (%1$s) yang tersedia (Anda menggunakan %2$s). Anda harus memperbaruinya secepatnya"
    }
}
