{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(a meno che il distributore della tua versione binaria di MariaDB stia facendo il backport delle patch di sicurezza)",
        "BackportingDisclaimerPHP": "(a meno che il distributore della tua versione binaria di PHP stia facendo il backport delle patch di sicurezza)",
        "CurlVersionCheckFailed": "Matomo non è riuscito a verificare se la tua versione di curl ha delle vulnerabilità.",
        "CurlVersionCheckLabel": "controllo versione curl",
        "CurlVersionCheckNoCurl": "La tua installazione di PHP non utilizza curl, quindi non c'è nulla da controllare.",
        "CurlVersionCheckUpToDate": "Sembra che non ci siano vulnerabilità conosciute per la tua versione di curl (%s).",
        "CurlVersionCheckVulnerable": "La tua versione di curl (%s) potrebbe avere queste vulnerabilità (a meno che il distributore della tua versione binaria di curl stia facendo il backport delle patch di sicurezza):",
        "DatabaseVersionCheckLabel": "Versione database",
        "DatabaseVersionCheckMariaDBEol": "La tua versione di MariaDB (%1$s) non riceve più alcun supporto di sicurezza dal team di MariaDB (questo da %2$s). Aggiornalo ad una versione più recente",
        "DatabaseVersionCheckMariaDBLatestVersion": "Stai usando l'ultima versione di MariaDB %s.",
        "DatabaseVersionCheckMariaDBNotEol": "La tua versione di MariaDB(%1$s) riceverà supporto di sicurezza dal team di MariaDB fino a %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "Esiste una versione aggiornata di MariaDB (%1$s) disponibile (stai usando la versione %2$s/%3$s). Dovresti aggiornarlo il prima possibile",
        "MatomoJSCheckFailed": "Sembra che matomo.js non possa essere raggiunto correttamente.",
        "MatomoJSCheckFailedCurlTip": "prova ad eseguire %s sul tuo server e controllare se è in grado di raggiungere il file",
        "MatomoJSCheckGzipped": "matomo.js viene restituito compresso.",
        "MatomoJSCheckMIMEError": "matomo.js dovrebbe essere distribuito con il Content-Type 'application/javascript'. Stai usando '%s'.",
        "MatomoJSCheckNotGzipped": "matomo.js non viene fornito gzippato. Si consiglia di impostare gzip per i file .js, in quanto può ridurre la dimensione del file fino al 60 %.",
        "MatomoJSCheckUnknown": "Matomo non è in grado di verificare se il file matomo.js può essere scaricato correttamente.",
        "NotificationText": "Hai abilitato il componente aggiuntivo DiagnosticExtended. Aggiunge alcuni altri controlli di sistema sperimentali (contrassegnato con 🧪) a questa pagina che potrebbero aiutarti a trovare problemi con la tua istanza Matomo. Potrebbero esserci ancora alcuni falsi positivi e falsi negativi, quindi non prendere i risultati come una verità, ma controlla tu stesso se qualcosa non va. Segnala i problemi con il componente aggiuntivo nel %1$sforum%2$s o %3$screa una Github issue%4$s così che i controlli possano essere migliorati.",
        "NotificationTitle": "Info su Diagnostica Estesa",
        "OpcacheCheckInternedStrings": "Sembra che tu abbia impostato <code>opcache.interned_strings_buffer</code> al di sotto degli 8MB e potrebbe essere un po' basso. Aumenta il valore a 8 (Megabyte) o più in base a quanti file PHP servi e alla memoria disponibile del tuo server.",
        "OpcacheCheckJIT": "Poiché stai utilizzando PHP 8 o più recente, è possibile esaminare l'abilitazione del compilatore JIT. Potrebbe essere in grado di accelerare Matomo di un po'. Sarebbe anche bello se potessi riportare eventuali esperienze dopo aver abilitato PHP JIT.",
        "OpcacheCheckMaxFiles": "Sembra che sia stato impostato <code>opcache.max_accelerated_files</code> a un valore inferiore o uguale a %s, che potrebbe essere troppo basso per mantenere tutti i file di Matomo nella cache, soprattutto se si ospitano anche altre applicazioni PHP. Imposta l'opzione a 7963, 16229 o 32531, a seconda del numero di file PHP utilizzati dal server web.",
        "OpcacheCheckMemory": "Sembra che sia stato impostato <code>opcache.memory_consumption</code> al di sotto di 128 MB, che potrebbe essere troppo basso per mantenere tutti i file Matomo nella cache, soprattutto se si ospitano anche altre applicazioni PHP. Aumentare il valore a 128 o 256 (Megabyte), a seconda del numero di file PHP utilizzati e della memoria disponibile sul server.",
        "OpcacheCheckOpcacheDisabled": "Sembra che OPcache sia disabilitato nella configurazione di PHP. OPcache memorizza il bytecode degli script PHP ed è quindi in grado di velocizzare notevolmente PHP, in quanto evita di caricare e analizzare i file PHP a ogni richiesta. Controlla l'impostazione <code>opcache.enable</code> nel file php.ini per maggiori informazioni.",
        "OpcacheCheckOpcacheEnabled": "Sembra che l'OPcache sia abilitata. %1$sMB di %2$sMB vengono usati per gli script PHP (%3$s%% sprecati) e %4$sMB di %5$sMB vengono usati per le stringhe internate. %6$s%% delle richieste colpiscono la OPcache.",
        "OpcacheCheckSaveComments": "Sembra che sia stata disabilitata l'impostazione <code>opcache.save_comments</code>. Questo rimuove i commenti dalla OPcache, rendendola più piccola, ma rompe Matomo. Impostare <code>opcache.save_comments</code> su <code>0</code>",
        "OpcacheCheckValidateTimestamps": "Sembra che si sia disabilitato <code>opcache.validate_timestamps</code>, il che significa che PHP non verificherà mai se i file effettivi sul disco sono cambiati, ma continuerà a usare quelli in cache. In teoria, questo non dovrebbe essere un problema, dato che Matomo invalida la OPcache durante gli aggiornamenti e le installazioni, ma si potrebbe comunque controllare se si riscontrano problemi strani.",
        "OpensslVersionCheckLabel": "Controllo versione OpenSSL",
        "OpensslVersionCheckNoOpenssl": "La tua configurazione di PHP non utilizza OpenSSL o curl, quindi non c'è nulla da controllare.",
        "OpensslVersionCheckNotOutdated": "La tua versione di OpenSSL (%s) non è molto vecchia. Tuttavia, verifica se ci sono vulnerabilità note e, se necessario, aggiornala.",
        "OpensslVersionCheckOutdated": "La tua versione di OpenSSL (%s) è piuttosto vecchia. Controlla se ci sono vulnerabilità note e, se necessario, aggiornala.",
        "PhpIniCheckIsDisabled": "%s è abilitato",
        "PhpIniCheckIsEnabled": "%s è abilitato",
        "PhpIniCheckLabel": "opzioni php.ini",
        "PhpIniCheckShouldBeDisabled": "%s dovrebbe essere disabilitato",
        "PhpIniCheckShouldBeEnabled": "%s dovrebbe essere abilitato",
        "PhpUserCheckLabel": "PHP in esecuzione come root",
        "PhpUserCheckWarning": "PHP sembra essere in esecuzione come root. A meno che non si stia usando Matomo all'interno di un container docker, si dovrebbe controllare la propria configurazione.",
        "PhpVersionCheckEol": "La tua versione di PHP (%1$s) non riceve più il supporto di sicurezza da parte del team PHP (sin dal %2$s). Dovresti aggiornare PHP ad una versione più recente",
        "PhpVersionCheckLabel": "Versione PHP",
        "PhpVersionCheckLatestVersion": "Stai usando l'ultima versione di PHP %s",
        "PhpVersionCheckNoInformation": "Non abbiamo informazioni sulla versione di PHP (%s)",
        "PhpVersionCheckNotEol": "La tua versione di PHP (%1$s) riceve il supporto di sicurezza da parte del team PHP fino al %2$s.",
        "PhpVersionCheckNotWorking": "Matomo non è riuscito a verificare se la versione di PHP è aggiornata",
        "PhpVersionCheckOutdated": "È disponibile una versione patch PHP più recente (%1$s) (stia usando la versione %2$s). Dovresti aggiornarla il prima possibile"
    }
}
