{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(med mindre distribut칮ren av din kj칮rbare MariaDB-fil legger inn sikkerhetsfikser for eldre versjoner)",
        "BackportingDisclaimerPHP": "(med mindre distribut칮ren av din kj칮rbare PHP-fil legger inn sikkerhetsfikser for eldre versjoner)",
        "CurlVersionCheckFailed": "Matomo kunne ikke sjekke om cURL-versjonen din har s친rbarheter.",
        "CurlVersionCheckLabel": "cURL-versjonssjekk",
        "CurlVersionCheckNoCurl": "PHP-oppsettet ditt bruker ikke cURL, s친 det er ingenting 친 sjekke.",
        "CurlVersionCheckUpToDate": "Det ser ikke ut til at det finnes noen kjente s친rbarheter i din cURL-versjon (%s).",
        "CurlVersionCheckVulnerable": "Din cURL-versjon (%s) kan ha s친rbarheter for disse svakhetene (med mindre distribut칮ren av din kj칮rbare cURL-bin칝rfil legger inn sikkerhetsfikser for gamle versjoner):",
        "DatabaseVersionCheckLabel": "Database-versjon",
        "DatabaseVersionCheckMariaDBEol": "Din MariaDB-versjon (%1$s) mottar ikke sikkerhetsst칮tte av MariaDB-laget lenger (siden %2$s). Du b칮r oppgradere til en nyere versjon.",
        "DatabaseVersionCheckMariaDBLatestVersion": "Du kj칮rer siste versjon av MariaDB %s.",
        "DatabaseVersionCheckMariaDBNotEol": "Din MariaDB-versjon (%1$s) mottar sikkerhetsst칮tte av MariaDB-laget til %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "Det finnes en nyere MariaDB-versjon (%1$s) tilgjengelig (du bruker %2$s/%3$s). Oppgrader s친 snart som mulig.",
        "MatomoJSCheckFailed": "Det ser ikke ut til at matomo.js kan hentes p친 ordentlig vis.",
        "MatomoJSCheckFailedCurlTip": "pr칮v 친 kj칮re %s p친 tjeneren din og sjekk om det kan hente filen",
        "MatomoJSCheckGzipped": "matomo.js levert i sammenpakket form.",
        "MatomoJSCheckMIMEError": "matomo.js b칮r leveres med en 춺application/javascript췉-innholdstype. Du bruker 춺%s췉.",
        "MatomoJSCheckNotGzipped": "matomo.js leveres ikke gzip-pakket. Det kan hende du vil sette opp gzip for .js.filer som kan redusere st칮rrelsen av filen opptil 60%.",
        "MatomoJSCheckUnknown": "Matomo kunne ikke sjekke om din matomo.js.fil kan hentes.",
        "NotificationText": "Du har skrudd p친 DiagnosticsExtended-programtillegget. Det legger til flere eksperimentelle systemsjekker (markert med 游빍) p친 denne siden. Dette kan hjelpe deg 친 finne problemer med din Matomo-instans. Det kan fremdeles v칝re falske positiver og negativer, s친 ikke ta resultatet som sannhet, men sjekk selv om noe er galt. Rapporter problemer med programtillegget til %1$sforumet%2$s eller %3$sopprett en GitHub-feilrapport%4$s slik at sjekkene kan forbedres.",
        "NotificationTitle": "Om DiagnosticsExtended",
        "OpcacheCheckInternedStrings": "Det ser ut til at du har satt <code>opcache.interned_strings_buffer</code> under 8 MB, som kan v칝re for lavt. 칒k det til en verdi p친 8 MB eller mer, avhengig av hvor mange PHP-filer du vertstjener og hvor mye minne tjeneren din har tilgjengelig.",
        "OpcacheCheckJIT": "Siden du bruker PHP 8 eller nyere, kan det hende du 칮nsker 친 skru p친 JIT-kompilatoren. Det kan gj칮re Matomo mye raskere. Det er kj칝rkomment om du innrapporterer din opplevelse etter 친 ha skrudd p친 PHP JIT.",
        "OpcacheCheckMaxFiles": "Det ser ut til at du har satt <code>opcache.max_accelerated_files</code> til eller under %s, som kan v칝re for lavt til 친 beholde alle Matomo-filene i hurtiglageret, spesielt hvis du ogs친 vertstjener andre PHP-programmer. Sett alternativet til 7696, 16229, eller 32531, avhengig av antallet PHP-filer din vev-tjener bruker.",
        "OpcacheCheckMemory": "Det ser ut til at du har satt <code>opcache.memory_consumption</code> under 128 MB, som kan v칝re for lavt til 친 beholde alle Matomo-filene i hurtiglageret, spesielt hvis du ogs친 vertstjener andre PHP-programmer. 칒k verdien til 128 eller 256 (MB) avhengig av hvor mange PHP-filer du vertstjener og hvor mye minne tjeneren din har tilgjengelig.",
        "OpcacheCheckOpcacheDisabled": "Der ser ut til at OPcache er avskrudd i ditt PHP-oppsett. OPcache lagrer bytekode for PHP-skript i minne, og kan derfor gj칮re PHP ganske mye raskere siden det unng친r fortolkning av PHP-filer ved hver foresp칮rsel. Sjekk <code>opcache.enable</code>-php.ini innstilling for mer info.",
        "OpcacheCheckOpcacheEnabled": "Det ser ut til at OPcache er p친sl친tt. %1$s MB av %2$s MB er brukt for PHP-skript. (%3$s&percnt; bortkastet) og %4$s MB av %5$s MB er i brukt for interne strenger. %6$s&percnt; av foresp칮rsler trafff OPcache-en.",
        "OpcacheCheckSaveComments": "Det ser ut til at du har skrudd av <code>opcache.save_comments</code>-innstillingen. Dette fjerner kommentarer fra OPcache som gj칮r den mindre, men det knekker Matomo. Sett <code>opcache.save_comments</code> til <code>0</code>",
        "OpcacheCheckValidateTimestamps": "Det ser ut til at du har skrudd av <code>opcache.validate_timestamps</code> noe som betyr at PHP aldri sjekker om de faktiske filene p친 disken har endret seg, men forsetter 친 bruke de hurtiglagrede. I teorien b칮r ikke dette v칝re et problem siden Matomo invaliderer OPcache ved oppgraderinger og installeringer, men det kan hende du b칮r sjekke dette hvis du st칮ter p친 merkelige problemer.",
        "OpensslVersionCheckLabel": "OpenSSL-versjonssjekk",
        "OpensslVersionCheckNoOpenssl": "Ditt PHP.oppsett bruker ikke OpenSSL eller cURL, s친 det er ingenting 친 sjekke.",
        "OpensslVersionCheckNotOutdated": "Din OpenSSL-versjon (%s) er veldig gammel. Sjekk om det finnes kjente s친rbarheter og oppgrader hvis n칮dvendig.",
        "OpensslVersionCheckOutdated": "Din OpenSSL-versjon (%s) er ganske gammel. Sjekk om det finnes kjente s친rbarheter og oppgrader hvis n칮dvendig.",
        "PhpIniCheckIsDisabled": "%s er p친skrudd",
        "PhpIniCheckIsEnabled": "%s er p친skrudd",
        "PhpIniCheckLabel": "php.ini-alternativer",
        "PhpIniCheckShouldBeDisabled": "%s b칮r skrus av",
        "PhpIniCheckShouldBeEnabled": "%s b칮r skrus p친",
        "PhpUserCheckLabel": "PHP kj칮rer som rot-bruker",
        "PhpUserCheckWarning": "PHP ser ut til 친 kj칮re som rot. Med mindre du bruker Matomo inni en Docker-beholder b칮r du sjekke oppsettet ditt.",
        "PhpVersionCheckEol": "Din PHP-versjon (%1$s) mottar ikke sikkerhetsst칮tte av PGP-laget lenger (siden %2$s). Oppgrader til en nyere versjon.",
        "PhpVersionCheckLabel": "PHP-versjon",
        "PhpVersionCheckLatestVersion": "Du kj칮rer siste versjon av PHP %s",
        "PhpVersionCheckNoInformation": "Ingen info er kjent om din PHP-versjon (%s)",
        "PhpVersionCheckNotEol": "Din PHP-versjon (%1$s) mottar sikkerhetsst칮tte av PHP-laget til %2$s.",
        "PhpVersionCheckNotWorking": "Matomo kunne ikke sjekke hvorvidt PHP-versjonen er oppdatert",
        "PhpVersionCheckOutdated": "Det finnes en nyere PHP-feilfiksversjon (%1$s) tilgjengelig (du bruker %2$s). Oppgrader s친 snart som mulig."
    }
}
