{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(tenzij de distributeur van uw MariaDB binary beveiligingspatches voor oudere versies ondersteunt)",
        "BackportingDisclaimerPHP": "(tenzij de distributeur van uw PHP binary beveiligingspatches voor oudere versies ondersteunt)",
        "CurlVersionCheckFailed": "Matomo kan de versie van curl niet checken op kwetsbaarheden.",
        "CurlVersionCheckLabel": "curl versiecontrole",
        "CurlVersionCheckNoCurl": "Uw PHP opzet gebruikt geen curl, er is dus niets te controleren.",
        "CurlVersionCheckUpToDate": "Het lijkt erop dat er geen bekende kwetsbaarheden zijn in uw curl-versie (%s).",
        "CurlVersionCheckVulnerable": "Uw curl-versie (%s) kan kwetsbaar zijn voor deze kwetsbaarheden (tenzij de distributeur van uw curl binary beveiligingspatches voor oudere versies ondersteunt):",
        "DatabaseVersionCheckLabel": "Database versie",
        "DatabaseVersionCheckMariaDBEol": "Uw MariaDB versie (%1$s) krijgt geen beveiligingsondersteuning meer van het MariaDB team (sinds %2$s). U zou moeten updaten naar een nieuwere versie",
        "DatabaseVersionCheckMariaDBLatestVersion": "U gebruikt de laatste versie van MariaDB %s.",
        "DatabaseVersionCheckMariaDBNotEol": "Uw MariaDB versie (%1$s) krijgt beveiligingsondersteuning van het MariaDB team tot %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "Er is een nieuwere MariaDB patch versie (%1$s) beschikbaar (u gebruikt %2$s/%3$s). U zou deze zo snel mogelijk moeten updaten",
        "MatomoJSCheckFailed": "Het lijkt erop dat matomo.js niet goed kan worden opgehaald.",
        "MatomoJSCheckFailedCurlTip": "probeer %s op uw server uit te voeren en kijk of het bestand met succes wordt opgehaald",
        "MatomoJSCheckGzipped": "matomo.js wordt gecomprimeerd afgeleverd.",
        "MatomoJSCheckMIMEError": "matomo.js moet aangeleverd worden met een 'application/javascript' Content-Type. U gebruikt '%s'.",
        "MatomoJSCheckNotGzipped": "matomo.js wordt niet gzip-gecomprimeerd aangeleverd. Misschien wilt u gzip instellen voor .js bestanden, omdat dit de bestandsgrootte kan verminderen tot 60 %.",
        "MatomoJSCheckUnknown": "Matomo kon niet controleren of uw matomo.js goed kan worden opgehaald.",
        "NotificationText": "U heeft de DiagnosticsExtended plugin ingeschakeld. Deze voegt een paar experimentele systeemcontroles (gemarkeerd met 🧪) toe aan deze pagina die u kunnen helpen bij het vinden van problemen met uw Matomo-instantie. Er kunnen nog steeds een paar vals-positieven en vals-negatieven zijn, dus neem de resultaten niet zomaar voor waar aan, maar controleer zelf of er iets mis is. Meld problemen met de plugin op het %1$sforum%2$s of %3$smaak een GitHub issue%4$s aan zodat de controles verbeterd kunnen worden.",
        "NotificationTitle": "Over DiagnosticsExtended",
        "OpcacheCheckInternedStrings": "Het lijkt erop dat u <code>opcache.interned_strings_buffer</code> onder de 8MB heeft ingesteld, wat misschien een beetje laag is. Verhoog de waarde naar 8 (megabyte) of meer, afhankelijk van hoeveel PHP-bestanden u serveert en hoeveel geheugen uw server beschikbaar heeft.",
        "OpcacheCheckJIT": "Aangezien u PHP 8 of nieuwer gebruikt, zou u kunnen bekijken of u de JIT-compiler kunt inschakelen. Het zou Matomo wat sneller kunnen maken. Het zou ook leuk zijn als u uw ervaringen na het inschakelen van PHP JIT zou kunnen melden.",
        "OpcacheCheckMaxFiles": "Het lijkt erop dat u <code>opcache.max_accelerated_files</code> heeft ingesteld op of onder %s wat te laag kan zijn om alle Matomo-bestanden in de cache te houden, zeker indien u ook andere PHP-applicaties host. Stel de optie in op 7963, 16229 of 32531, afhankelijk van het aantal PHP-bestanden dat uw webserver gebruikt.",
        "OpcacheCheckMemory": "Het lijkt erop dat u <code>opcache.memory_consumption</code> onder de 128MB heeft gezet. Dat is misschien te weinig om alle Matomo-bestanden in de cache te houden, zeker indien u ook andere PHP-applicaties host. Verhoog de waarde naar 128 of 256 (megabyte), afhankelijk van hoeveel PHP-bestanden u serveert en hoeveel geheugen uw server beschikbaar heeft.",
        "OpcacheCheckOpcacheDisabled": "Het lijkt erop dat OPcache is uitgeschakeld in uw PHP-installatie. OPcache slaat de bytecode van PHP-scripts op in het geheugen en kan daarom PHP behoorlijk versnellen, omdat het voorkomt dat PHP-bestanden bij elk verzoek worden geladen en verwerkt. Controleer de <code>opcache.enable</code> php.ini instelling voor meer informatie.",
        "OpcacheCheckOpcacheEnabled": "Het lijkt erop dat OPcache ingeschakeld is. %1$sMB van %2$sMB wordt gebruikt voor PHP-scripts (%3$s%% verspild) en %4$sMB van %5$sMB wordt gebruikt voor geïnterneerde strings. %6$s%% van de verzoeken bereiken de OPcache.",
        "OpcacheCheckSaveComments": "Het lijkt erop dat u de <code>opcache.save_comments</code> instelling heeft uitgeschakeld. Dit verwijdert commentaar uit de OPcache waardoor deze kleiner wordt, maar breekt Matomo. Zet <code>opcache.save_comments</code> op <code>0</code>",
        "OpcacheCheckValidateTimestamps": "Het lijkt erop dat u <code>opcache.validate_timestamps</code> heeft uitgeschakeld, wat betekent dat PHP nooit zal controleren of de werkelijke bestanden op de schijf zijn gewijzigd, maar de bestanden in de cache blijft gebruiken. In theorie zou dit geen probleem moeten zijn omdat Matomo de OPcache ongeldig maakt bij updates en installaties, maar u zou hier toch naar kunnen kijken als u vreemde problemen tegenkomt.",
        "OpensslVersionCheckLabel": "OpenSSL versiecontrole",
        "OpensslVersionCheckNoOpenssl": "Uw PHP-opzet gebruikt geen OpenSSL of curl, er valt dus niets te controleren.",
        "OpensslVersionCheckNotOutdated": "Uw OpenSSL-versie (%s) is niet echt oud. Controleer niettemin of er gekende kwetsbaarheden voor zijn en werk die zo nodig bij.",
        "OpensslVersionCheckOutdated": "Uw OpenSSL versie (%s) is vrij oud. Controleer of er gekende kwetsbaarheden voor zijn en werk die zo nodig bij.",
        "PhpIniCheckIsDisabled": "%s is ingeschakeld",
        "PhpIniCheckIsEnabled": "%s is ingeschakeld",
        "PhpIniCheckLabel": "php.ini opties",
        "PhpIniCheckShouldBeDisabled": "%s zou moeten uitgeschakeld worden",
        "PhpIniCheckShouldBeEnabled": "%s zou moeten ingeschakeld worden",
        "PhpUserCheckLabel": "PHP draait als root",
        "PhpUserCheckWarning": "PHP lijkt als root te draaien. Tenzij u Matomo in een docker container gebruikt, moet u uw opzet controleren.",
        "PhpVersionCheckEol": "Uw PHP versie (%1$s) krijgt geen beveiligingsondersteuning meer van het PHP team (sinds %2$s). U zou moeten updaten naar een nieuwere versie",
        "PhpVersionCheckLabel": "PHP versie",
        "PhpVersionCheckLatestVersion": "U gebruikt de laatste versie van PHP %s",
        "PhpVersionCheckNoInformation": "Er is geen informatie bekend over uw PHP versie (%s)",
        "PhpVersionCheckNotEol": "Uw PHP versie (%1$s) krijgt beveiligingsondersteuning van het PHP team tot %2$s.",
        "PhpVersionCheckNotWorking": "Matomo kon niet controleren of uw PHP versie up-to-date is",
        "PhpVersionCheckOutdated": "Er is een nieuwere PHP-patch versie (%1$s) beschikbaar (u gebruikt %2$s). U zou deze zo snel mogelijk moeten updaten"
    }
}
