{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(a menos que o distribuidor do seu binário MariaDB esteja suportando patches de segurança)",
        "BackportingDisclaimerPHP": "(a menos que o distribuidor do seu binário PHP esteja suportando patches de segurança)",
        "CurlVersionCheckFailed": "O Matomo não pôde verificar se sua versão curl tem vulnerabilidades.",
        "CurlVersionCheckLabel": "verificação de versão curl",
        "CurlVersionCheckNoCurl": "Sua configuração PHP não usa curl, então não há nada para verificar.",
        "CurlVersionCheckUpToDate": "Parece que não há vulnerabilidades conhecidas em sua versão curl (%s).",
        "CurlVersionCheckVulnerable": "Sua versão do curl (%s) pode estar vulnerável a essas vulnerabilidades (a menos que o distribuidor do binário do curl esteja oferecendo patches de segurança):",
        "DatabaseVersionCheckLabel": "Versão do banco de dados",
        "DatabaseVersionCheckMariaDBEol": "Sua versão do MariaDB (%1$s) não recebe mais suporte de segurança da equipe do MariaDB (desde %2$s). Você deve atualizar para uma versão mais recente",
        "DatabaseVersionCheckMariaDBLatestVersion": "Você está usando a versão mais recente do MariaDB %s.",
        "DatabaseVersionCheckMariaDBNotEol": "Sua versão do MariaDB (%1$s) recebe suporte de segurança da equipe do MariaDB até %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "Há uma versão mais recente do patch do MariaDB (%1$s) disponível (você está usando %2$s/%3$s). Você deve atualizá-lo o mais rápido possível",
        "MatomoJSCheckFailed": "Parece que matomo.js não pode ser obtido corretamente.",
        "MatomoJSCheckFailedCurlTip": "tente executar %s em seu servidor e veja se ele consegue buscar o arquivo com sucesso",
        "MatomoJSCheckGzipped": "matomo.js é entregue compactado.",
        "MatomoJSCheckMIMEError": "matomo.js deve ser entregue com um tipo de conteúdo 'application/javascript'. Você está usando '%s'.",
        "MatomoJSCheckNotGzipped": "matomo.js não é entregue gzipado. Você pode configurar o gzip para arquivos .js, pois ele pode reduzir o tamanho do arquivo em até 60%.",
        "MatomoJSCheckUnknown": "Matomo não pôde verificar se seu matomo.js pode ser obtido corretamente.",
        "NotificationText": "Você ativou o plug-in DiagnosticsExtended. Ele adiciona mais algumas verificações de sistema experimentais (marcadas com 🧪) a esta página que podem ajudá-lo a encontrar problemas com sua instância do Matomo. Ainda pode haver alguns falsos positivos e falsos negativos, então não tome os resultados como uma verdade, mas verifique você mesmo se algo está errado. Relate problemas com o plug-in no %1$sforum%2$s ou %3$scrie uma issue no GitHub%4$s para que as verificações possam ser aprimoradas.",
        "NotificationTitle": "Sobre DiagnosticsExtended",
        "OpcacheCheckInternedStrings": "Parece que você definiu <code>opcache.interned_strings_buffer</code> abaixo de 8 MB, o que pode ser um pouco baixo. Aumente o valor para 8 (Megabytes) ou mais, dependendo de quantos arquivos PHP você atende e quanta memória seu servidor tem disponível.",
        "OpcacheCheckJIT": "Como você está usando o PHP 8 ou mais recente, você pode querer habilitar o compilador JIT. Pode ser capaz de acelerar um pouco o Matomo. Também seria ótimo se você pudesse relatar quaisquer experiências após habilitar o PHP JIT.",
        "OpcacheCheckMaxFiles": "Parece que você definiu <code>opcache.max_accelerated_files</code> para %s ou abaixo, o que pode ser muito baixo para manter todos os arquivos Matomo no cache, especialmente se você também estiver hospedando outros aplicativos PHP. Defina a opção para 7963, 16229 ou 32531, dependendo do número de arquivos PHP que seu servidor usa.",
        "OpcacheCheckMemory": "Parece que você definiu <code>opcache.memory_consumption</code> abaixo de 128 MB, o que pode ser muito baixo para manter todos os arquivos Matomo no cache, especialmente se você também estiver hospedando outros aplicativos PHP. Aumente o valor para 128 ou 256 (Megabyte) dependendo de quantos arquivos PHP você atende e quanta memória seu servidor tem disponível.",
        "OpcacheCheckOpcacheDisabled": "Parece que o OPcache está desabilitado na configuração do PHP. O OPcache armazena bytecode de scripts PHP na memória e, portanto, é capaz de acelerar bastante o PHP, pois evita o carregamento e a análise de arquivos PHP a cada solicitação. Verifique a configuração <code>opcache.enable</code> php.ini para obter mais informações.",
        "OpcacheCheckOpcacheEnabled": "Parece que o OPcache está ativado. %1$sMB de %2$sMB são usados para scripts PHP (%3$s; desperdiçados) e %4$sMB de %5$sMB são usados para strings internas. %6$s das solicitações atingem o OPcache.",
        "OpcacheCheckSaveComments": "Parece que você desativou a configuração <code>opcache.save_comments</code>. Isso remove os comentários do OPcache, tornando-o menor, mas quebra o Matomo. Defina <code>opcache.save_comments</code> como <code>0</code>",
        "OpcacheCheckValidateTimestamps": "Parece que você desativou <code>opcache.validate_timestamps</code>, o que significa que o PHP nunca verificará se os arquivos reais no disco foram alterados, mas continuará a usar os armazenados em cache. Em teoria, isso não deve ser problema, pois o Matomo invalida o OPcache em atualizações e instalações, mas você ainda pode querer investigar isso se encontrar problemas estranhos.",
        "OpensslVersionCheckLabel": "Verificação da versão do OpenSSL",
        "OpensslVersionCheckNoOpenssl": "Sua configuração PHP não usa OpenSSL ou curl, então não há nada para verificar.",
        "OpensslVersionCheckNotOutdated": "Sua versão do OpenSSL (%s) não é muito antiga. No entanto, verifique se existem vulnerabilidades conhecidas para ele e atualize-o, se necessário.",
        "OpensslVersionCheckOutdated": "Sua versão do OpenSSL (%s) é bem antiga. Verifique se há vulnerabilidades conhecidas para ele e atualize-o se necessário.",
        "PhpIniCheckIsDisabled": "%s está ativado",
        "PhpIniCheckIsEnabled": "%s está ativado",
        "PhpIniCheckLabel": "opções do php.ini",
        "PhpIniCheckShouldBeDisabled": "%s deve ser desabilitado",
        "PhpIniCheckShouldBeEnabled": "%s deve ser ativado",
        "PhpUserCheckLabel": "PHP rodando como root",
        "PhpUserCheckWarning": "O PHP parece estar rodando como root. A menos que você esteja usando o Matomo dentro de um contêiner docker, verifique sua configuração.",
        "PhpVersionCheckEol": "Sua versão do PHP (%1$s) não recebe mais suporte de segurança da equipe do PHP (desde %2$s). Você deve atualizar para uma versão mais recente",
        "PhpVersionCheckLabel": "Versão PHP",
        "PhpVersionCheckLatestVersion": "Você está usando a versão mais recente do PHP %s",
        "PhpVersionCheckNoInformation": "Nenhuma informação é conhecida sobre sua versão do PHP (%s)",
        "PhpVersionCheckNotEol": "Sua versão do PHP (%1$s) recebe suporte de segurança da equipe do PHP até %2$s.",
        "PhpVersionCheckNotWorking": "Matomo não pôde verificar se sua versão do PHP está atualizada",
        "PhpVersionCheckOutdated": "Há uma versão mais recente do patch do PHP (%1$s) disponível (você está usando %2$s). Você deve atualizá-lo o mais rápido possível"
    }
}
