{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(om nu inte distribut칬ren av din MariaDB-bin칛r tillbakaportar s칛kerhetsfixar)",
        "BackportingDisclaimerPHP": "(om nu inte distribut칬ren av din PHP-bin칛r tillbakaportar s칛kerhetsfixar)",
        "CurlVersionCheckFailed": "Matomo kunde inte kontrollera om din cURL-version har s친rbarheter.",
        "CurlVersionCheckLabel": "versionskontroll av cURL",
        "CurlVersionCheckNoCurl": "Din PHP-installation anv칛nder inte cURL s친 det finns inget att kontrollera.",
        "CurlVersionCheckUpToDate": "Det verkar inte finnas n친gra k칛nda s친rbarheter f칬r den version av cURL du anv칛nder (%s).",
        "CurlVersionCheckVulnerable": "Din cURL-version (%s) kan vara s친rbar f칬r f칬ljande brister (om nu inte distribut칬ren av din cURL-bin칛r tillbakaportar s칛kerhetsfixar):",
        "DatabaseVersionCheckLabel": "Databasversion",
        "DatabaseVersionCheckMariaDBEol": "Din version av MariaDB (%1$s) f친r inte l칛ngre n친gon s칛kerhetssupport av MariaDB-teamet (sedan %2$s). Du borde uppdatera till en nyare version",
        "DatabaseVersionCheckMariaDBLatestVersion": "Du anv칛nder den senaste versionen av MariaDB %s.",
        "DatabaseVersionCheckMariaDBNotEol": "Din version av MariaDB (%1$s) tar emot s칛kerhetsuppdateringar fr친n MariaDB-teamet fram till %2$s.",
        "DatabaseVersionCheckMariaDBOutdated": "Det finns en nyare MariaDB-patchversion (%1$s) tillg칛nglig (du har %2$s/%3$s). Du borde uppdatera s친 snart som m칬jligt",
        "MatomoJSCheckFailed": "Verkar som att matomo.js inte kan h칛mtas korrekt.",
        "MatomoJSCheckFailedCurlTip": "pr칬va att k칬ra %s p친 din server och se om det lyckas h칛mta filen",
        "MatomoJSCheckGzipped": "matomo.js skickas i komprimerad form.",
        "MatomoJSCheckMIMEError": "matomo.js borde skickas med en 'application/javascript' som Content-Type. Du anv칛nder '%s'.",
        "MatomoJSCheckNotGzipped": "matomo.js skickas inte gzippad. Du vill nog s칛tta upp gzip f칬r .js-filer d친 det kan reducera filstorleken med upp till 60 %.",
        "MatomoJSCheckUnknown": "Matomo kunde inte kolla om din matomo.js kan h칛mtas p친 ett korrekt s칛tt.",
        "NotificationText": "Du har aktiverat till칛gget DiagnosticsExtended. Det l칛gger till ett antal experimentella systemkontroller (m칛rks med 游빍) till denna sida och kan hj칛lpa dig med problem med din Matomo-instans. Det kan finnas ett antal falskpositiva och falsknegativa, s친 du b칬r inte ta resultaten f칬r sanning utan kolla efter sj칛lv vad som felar. V칛nligen rapportera felaktigheter med till칛gget till %1$sforumet%2$s eller %3$sskapa GitHub-issues%4$s s친 kontrollerna kan f칬rb칛ttras.",
        "NotificationTitle": "Om DiagnosticsExtended",
        "OpcacheCheckInternedStrings": "Du verkar ha satt <code>opcache.interned_strings_buffer</code> l칛gre 칛n 8MB vilket kan vara f칬r lite. V칛nligen 칬ka v칛rdet till 8 (Megabyte) eller mer, beroende p친 hur m친nga PHP-filer du har och hur mycket minne din server har tillg칛ngligt.",
        "OpcacheCheckJIT": "Eftersom du anv칛nder PHP 8 eller nyare, kanske du vill aktivera JIT-kompilering. Det kan snabba upp Matomo en del. Det vore ocks친 vara bra om du kunde rapportera om dina erfarenheter tillbaka efter att du aktiverat PHP JIT.",
        "OpcacheCheckMaxFiles": "Du tycks ha satt <code>opcache.max_accelerated_files</code> till, eller mindre 칛n, %s vilket kan vara f칬r lite f칬r att h친lla alla Matomo-filer i cache, s칛rskilt om du ocks친 har andra PHP-applikationer. V칛nligen s칛tt det ist칛llet till 7963, 16229 eller 32531 beroende p친 antalet PHP-filer din webbserver anv칛nder.",
        "OpcacheCheckMemory": "Du verkar ha angett <code>opcache.memory_consumption</code> till mindre 칛n 128MB vilket kan vara f칬r l친gt f칬r att h친lla alla Matomo-filer i cache, s칛rskilt om du ocks친 driftar andra PHP-applikationer. V칛nligen 칬ka det till 128 eller 256 (Megabyte) beroende p친 hur m친nga PHP-filer du har och m칛ngden minne som servern har tillg칛ngligt.",
        "OpcacheCheckOpcacheDisabled": "OPcache verkar vara inaktiverad i din PHP-upps칛ttning. OPcache sparar bytekod av PHP-skript i minnet och snabbar d칛rf칬r upp PHP en hel del eftersom det inte laddar PHP-filerna vid varje f칬rfr친gan. Kolla <code>opcache.enable</code>-inst칛llningen i php.ini f칬r mer information.",
        "OpcacheCheckOpcacheEnabled": "OPcache verkar vara aktiverad. %1$sMB av %2$sMB anv칛nds f칬r PHP-skript (%3$s%% sl칬sas) och %4$sMB av %5$sMB anv칛nds f칬r internerade str칛ngar. %6$s%% av f칬rfr친gningarna tr칛ffar OPcache.",
        "OpcacheCheckSaveComments": "Du tycks ha inaktiverat inst칛llningen <code>opcache.save_comments</code>. Detta tar bort kommentarer fr친n OPcache vilket g칬r dem mindre men f칬rst칬r f칬r Matomo. V칛nligen s칛tt <code>opcache.save_comments</code> till <code>0</code>",
        "OpcacheCheckValidateTimestamps": "Du tycks ha inaktiverat <code>opcache.validate_timestamps</code> vilket betyder att PHP aldrig kommer att kolla om den aktuella filen p친 disk har f칬r칛ndrats, utan forts칛tter p친 den cachade. I teorin beh칬ver det inte uppst친 problem d친 Matomo invaliderar OPcache vid uppdateringar och installationer, men du b칬r nog ta en titt p친 detta om du st칬ter p친 m칛rkliga bekymmer.",
        "OpensslVersionCheckLabel": "Versionskontroll av OpenSSL",
        "OpensslVersionCheckNoOpenssl": "Din PHP-konfiguration anv칛nder inte OpenSSL eller cURL, s친 det finns inget att kontrollera.",
        "OpensslVersionCheckNotOutdated": "Din OpenSSL-version (%s) 칛r inte s칛rskilt gammal. Oavsett 칛r det v칛rt att kolla om det finns n친gra k칛nda s친rbarheter f칬r din version och v칛lja att uppdatera om behov finns.",
        "OpensslVersionCheckOutdated": "Din OpenSSL-version (%s) 칛r ganska gammal. Kontrollera om det finns k칛nda s친rbarheter och uppdatera vid behov.",
        "PhpIniCheckIsDisabled": "%s 칛r aktiverad",
        "PhpIniCheckIsEnabled": "%s 칛r aktiverad",
        "PhpIniCheckLabel": "php.ini-valm칬jligheter",
        "PhpIniCheckShouldBeDisabled": "%s borde inaktiveras",
        "PhpIniCheckShouldBeEnabled": "%s borde aktiveras",
        "PhpUserCheckLabel": "PHP k칬rs som root",
        "PhpUserCheckWarning": "PHP verkar k칬ras som root. Om du inte anv칛nder Matomo inifr친n en docker-container borde du granska din upps칛ttning.",
        "PhpVersionCheckEol": "Din PHP-version (%1$s) tar inte l칛ngre emot s칛kerhetssupport fr친n PHP-teamet (sedan %2$s). Du borde uppdatera till en nyare version",
        "PhpVersionCheckLabel": "PHP-version",
        "PhpVersionCheckLatestVersion": "Du anv칛nder den senaste versionen av PHP %s",
        "PhpVersionCheckNoInformation": "Ingen k칛nd information om din PHP-version (%s)",
        "PhpVersionCheckNotEol": "Din PHP-version (%1$s) tar emot s칛kerhetssupport av PHP-teamet fram till %2$s.",
        "PhpVersionCheckNotWorking": "Matomo kunde inte kolla om din PHP-version 칛r aktuell",
        "PhpVersionCheckOutdated": "Det finns en nyare PHP-patchversion (%1$s) tillg칛nglig (du anv칛nder %2$s). Du borde uppdatera s친 snart som m칬jligt"
    }
}
