{
    "DiagnosticsExtended": {
        "BackportingDisclaimerMariaDB": "(MariaDB binary dosyan覺z覺n da覺t覺c覺s覺 g羹venlik yamalar覺n覺 desteklemiyorsa)",
        "BackportingDisclaimerPHP": "(PHP binary dosyan覺z覺n da覺t覺c覺s覺 g羹venlik yamalar覺n覺 desteklemiyorsa)",
        "CurlVersionCheckFailed": "Matomo, cURL s羹r羹m羹n羹z羹n g羹venlik a癟覺klar覺 olup olmad覺覺n覺 denetleyemedi.",
        "CurlVersionCheckLabel": "cURL s羹r羹m羹 denetimi",
        "CurlVersionCheckNoCurl": "PHP kurulumunuz cURL kullanm覺yor, bu y羹zden denetlenecek bir ey yok.",
        "CurlVersionCheckUpToDate": "cURL s羹r羹m羹n羹zde (%s) bilinen bir g羹venlik a癟覺覺 yok gibi g繹r羹n羹yor.",
        "CurlVersionCheckVulnerable": "cURL s羹r羹m羹n羹z (%s) bu g羹venlik a癟覺klar覺na kar覺 savunmas覺z olabilir (cuRL binary dosyan覺z覺n da覺t覺c覺s覺 g羹venlik yamalar覺n覺 geriye d繹n羹k olarak salam覺yorsa):",
        "DatabaseVersionCheckLabel": "Veri taban覺 s羹r羹m羹",
        "DatabaseVersionCheckMariaDBEol": "MariaDB s羹r羹m羹n羹ze (%1$s) art覺k MariaDB ekibi taraf覺ndan g羹venlik destei salanm覺yor (%2$s zaman覺ndan beri). Daha yeni bir s羹r羹me g羹ncellemelisiniz",
        "DatabaseVersionCheckMariaDBLatestVersion": "G羹ncel MariaDB %s s羹r羹m羹n羹 kullan覺yorsunuz.",
        "DatabaseVersionCheckMariaDBNotEol": "MariaDB s羹r羹m羹n羹ze (%1$s), MariaDB ekibi taraf覺ndan %2$s tarihine kadar g羹venlik destei salanacak.",
        "DatabaseVersionCheckMariaDBOutdated": "Daha yeni bir MariaDB yama s羹r羹m羹 (%1$s) yay覺nlanm覺 (%2$s/%3$s kullan覺yorsunuz). En k覺sa zamanda g羹ncellemelisiniz",
        "MatomoJSCheckFailed": "Matomo.js d羹zg羹n ekilde al覺nam覺yor gibi g繹r羹n羹yor.",
        "MatomoJSCheckFailedCurlTip": "sunucunuzda %s 癟al覺t覺rmay覺 deneyin ve dosyay覺 baar覺yla al覺p alamad覺覺n覺 g繹r羹n",
        "MatomoJSCheckGzipped": "matomo.js s覺k覺t覺r覺lm覺 olarak aktar覺ld覺.",
        "MatomoJSCheckMIMEError": "matomo.js, bir 'application/javascript' Content-Type ile aktar覺lmal覺d覺r. '%s' kullan覺yorsunuz.",
        "MatomoJSCheckNotGzipped": "matomo.js gzip ile s覺k覺t覺r覺lm覺 olarak aktar覺lmad覺. Dosya boyutunu % 60 oran覺nda k羹癟羹ltebileceinden, .js dosyalar覺 i癟in gzip kullan覺lmas覺n覺 salamak isteyebilirsiniz.",
        "MatomoJSCheckUnknown": "Matomo, matomo.js dosyan覺z覺n d羹zg羹n ekilde al覺n覺p al覺nmad覺覺n覺 denetleyemedi.",
        "NotificationText": "DiagnosticsExtended eklentisini etkinletirdiniz. Bu eklenti bu sayfaya, Matomo kopyan覺zla ilgili sorunlar覺 bulman覺za yard覺mc覺 olabilecek birka癟 deneysel sistem denetimi (妒 ile iaretlenmitir) ekler. H璽l璽 birka癟 yanl覺 pozitif ve yanl覺 negatif sonu癟 g繹rebilirsiniz. Bu y羹zden t羹m sonu癟lar覺 doru olarak alg覺lamay覺n, bir eylerin yanl覺 olup olmad覺覺n覺 kendiniz de denetleyin. Denetimlerin iyiletirilebilmesi i癟in eklentiyle ilgili sorunlar覺 %1$sforum%2$s veya %3$sGitHub%4$s 羹zerinden bildirin.",
        "NotificationTitle": "DiagnosticsExtended hakk覺nda",
        "OpcacheCheckInternedStrings": "G繹r羹n羹e g繹re <code>opcache.interned_strings_buffer</code> se癟eneini 8MB alt覺nda bir deere ayarlam覺s覺n覺z. Bu deer biraz d羹羹k olabilir. L羹tfen ka癟 PHP dosyas覺 sunduunuza ve sunucunuzun ne kadar bellei olduuna bal覺 olarak deeri 8 (Megabayt) veya 羹zerine ayarlay覺n.",
        "OpcacheCheckJIT": "PHP 8 veya daha yeni bir s羹r羹m羹n羹 kulland覺覺n覺z i癟in JIT derleyicisini a癟mak isteyebilirsiniz. B繹ylece Matomo biraz daha h覺zlanabilir. PHP JIT derleyicisini a癟t覺ktan sonra deneyiminizi bize bildirmeniz de harika olur.",
        "OpcacheCheckMaxFiles": "G繹r羹n羹e g繹re <code>opcache.max_accelerated_files</code> se癟eneini %s veya alt覺nda bir deere ayarlam覺s覺n覺z. Bu deer, 繹zellikle dier PHP uygulamalar覺n覺 da bar覺nd覺r覺yorsan覺z, t羹m Matomo dosyalar覺n覺 繹n bellekte tutmak i癟in 癟ok d羹羹k kalabilir. L羹tfen site sunucunuzun kulland覺覺 PHP dosyalar覺n覺n say覺s覺na bal覺 olarak se癟enei 7963, 16229 veya 32531 olarak ayarlay覺n.",
        "OpcacheCheckMemory": "G繹r羹n羹e g繹re <code>opcache.memory_consumption</code> se癟eneini 128MB alt覺nda bir deere ayarlam覺s覺n覺z. Bu durum, 繹zellikle dier PHP uygulamalar覺n覺 da bar覺nd覺r覺yorsan覺z, t羹m Matomo dosyalar覺n覺 繹n bellekte tutmak i癟in 癟ok d羹羹k kalabilir. L羹tfen ka癟 PHP dosyas覺 sunduunuza ve sunucunuzun ne kadar bellei olduuna bal覺 olarak deeri 128 veya 256 (Megabayt) olarak ayarlay覺n.",
        "OpcacheCheckOpcacheDisabled": "PHP kurulumunuzda OPcache 繹zellii kapat覺lm覺 gibi g繹r羹n羹yor. OPcache, PHP betiklerinin bayt kodunu bellekte saklar ve bu nedenle, her istekte PHP dosyalar覺n覺n y羹klenmesini ve ilenmesini 繹nledii i癟in PHP 癟al覺mas覺n覺 biraz h覺zland覺rabilir. Ayr覺nt覺l覺 bilgi almak i癟in <code>opcache.enable</code> php.ini ayar覺n覺 denetleyin.",
        "OpcacheCheckOpcacheEnabled": "OPcache 繹zellii a癟覺lm覺 gibi g繹r羹n羹yor. PHP betikleri i癟in %1$sMB/ %2$sMB kullan覺l覺r (%%%3$s boa gider) ve ele al覺nan dizgeler i癟in %4$sMB / %5$sMB kullan覺l覺r. 襤stekler %%%6$s oran覺nda OPcache 羹zerine ulat覺.",
        "OpcacheCheckSaveComments": "<code>opcache.save_comments</code> se癟eneini kapatms覺n覺z gibi g繹r羹n羹yor. Bu durum, OPcache 羹zerindeki yorumlar覺 kald覺r覺r ve onu k羹癟羹lt羹r, ancak Matomo 癟al覺mas覺n覺 bozar. L羹tfen <code>opcache.save_comments</code> se癟eneini <code>0</code> olarak ayarlay覺n",
        "OpcacheCheckValidateTimestamps": "<code>opcache.validate_timestamps</code> se癟eneini kapatm覺s覺n覺z gibi g繹r羹n羹yor. Bu da PHP taraf覺ndan diskteki ger癟ek dosyalar覺n deiip deimediinin asla denetlenemeyecei, ancak 繹n bellee al覺nan dosyalar覺n kullan覺lmas覺n覺n s羹rd羹r羹lecei anlam覺na geliyor. Teorik olarak, g羹ncelleme ve kurulum ilemlerinde Matomo OPcache 繹zelliini kapatt覺覺 i癟in bu durum bir sorun 癟覺karmamal覺d覺r. Ancak garip sorunlarla kar覺la覺rsan覺z buna da bir bakman覺z iyi olabilir.",
        "OpensslVersionCheckLabel": "OpenSSL s羹r羹m denetimi",
        "OpensslVersionCheckNoOpenssl": "PHP kurulumunuz OpenSSL veya cURL kullanm覺yor. Bu nedenle denetlenecek bir ey yok.",
        "OpensslVersionCheckNotOutdated": "OpenSSL s羹r羹m羹n羹z (%s) 癟ok eski deil. Bununla birlikte, bu s羹r羹m i癟in bilinen g羹venlik a癟覺klar覺 olup olmad覺覺n覺 denetleyin ve gerekirse s羹r羹m羹 g羹ncelleyin.",
        "OpensslVersionCheckOutdated": "OpenSSL s羹r羹m羹n羹z (%s) olduk癟a eski. Bilinen g羹venlik a癟覺klar覺 olup olmad覺覺n覺 denetleyin ve gerekirse s羹r羹m羹n羹 g羹ncelleyin.",
        "PhpIniCheckIsDisabled": "%s a癟覺k",
        "PhpIniCheckIsEnabled": "%s a癟覺k",
        "PhpIniCheckLabel": "php.ini se癟enekleri",
        "PhpIniCheckShouldBeDisabled": "%s kapat覺lmal覺d覺r",
        "PhpIniCheckShouldBeEnabled": "%s a癟覺lmal覺",
        "PhpUserCheckLabel": "PHP root olarak 癟al覺覺yor",
        "PhpUserCheckWarning": "PHP root olarak 癟al覺覺yor gibi g繹r羹n羹yor. Matomo uygulamas覺n覺 bir docker kab覺n覺n i癟inde kullanm覺yorsan覺z, kurulumunuzu denetlemelisiniz.",
        "PhpVersionCheckEol": "PHP s羹r羹m羹n羹ze (%1$s) art覺k PHP ekibi taraf覺ndan g羹venlik destei salanm覺yor (%2$s zaman覺ndan beri). Daha yeni bir s羹r羹me g羹ncellemelisiniz",
        "PhpVersionCheckLabel": "PHP s羹r羹m羹",
        "PhpVersionCheckLatestVersion": "G羹ncel PHP %s s羹r羹m羹n羹 kullan覺yorsunuz",
        "PhpVersionCheckNoInformation": "PHP s羹r羹m羹n羹z hakk覺nda herhangi bir ey bilinmiyor (%s)",
        "PhpVersionCheckNotEol": "PHP s羹r羹m羹n羹ze (%1$s), PHP ekibi taraf覺ndan %2$s tarihine kadar g羹venlik destei salanacak.",
        "PhpVersionCheckNotWorking": "Matomo, PHP s羹r羹m羹n羹z羹n g羹ncel olup olmad覺覺n覺 denetleyemedi",
        "PhpVersionCheckOutdated": "Daha yeni bir PHP yama s羹r羹m羹 (%1$s) yay覺nlanm覺 (%2$s kullan覺yorsunuz). En k覺sa zamanda g羹ncellemelisiniz",
        "URLCheckConfigIni": "%s yar覺 herkese a癟覺k gibi g繹r羹n羹yor. Sald覺rganlar u anda yap覺land覺rmay覺 okuyamasa da, dosyaya herkes taraf覺ndan eriilebilir ve web sunucunuz herhangi bir nedenle gelecekte PHP dosyalar覺n覺 y羹r羹tmeyi durdurursa, herkes MySQL kimlik bilgilerinizi ve daha fazlas覺n覺 g繹rebilir. L羹tfen web sunucusu yap覺land覺rman覺z覺 denetleyin.",
        "URLCheckError": "%s asla herkese a癟覺k olmamal覺, ama 繹yle g繹r羹n羹yor. L羹tfen web sunucusu yap覺land覺rman覺z覺 denetleyin.",
        "URLCheckLabel": "Herkese a癟覺k olmamas覺 gereken dosyalar",
        "URLCheckLongErrorMessage": "L羹tfen web sunucunuzun Matomo taraf覺ndan oluturulan .htaccess dosyalar覺n覺 d羹zg羹n ekilde ileyip ilemediini denetleyin. Nginx kullan覺yorsan覺z, herkese a癟覺k olmamas覺 gereken dosyalara referans olmas覺 i癟in %1$sresmi matomo-nginx yap覺land覺rmas覺na%2$s bakabilirsiniz.<br> Bunlar doru yap覺lmam覺sa sald覺rganlar hassas verileri okuyabilir.",
        "URLCheckOk": "%s herkes taraf覺ndan eriilebilir gibi g繹r羹nm羹yor",
        "URLCheckSkipped": "襤nternet 繹zellikleri devre d覺覺 olduundan bu denetim atland覺."
    }
}
